[
  {
    "name": "Acid Splash",
    "school": "Conjuration",
    "casting time": "1 action",
    "ritual": "no",
    "range": "60 ft",
    "target": "single",
    "components": "V, S",
    "duration": "instantaneous",
    "saving throw": "No",
    "concentration": "No",
    "description": "\tYou hurl a bubble of acid.\n\tChoose one creature within range, or choose two creatures within range that are within 5 feet of each other.\n\tA target must succeed on a Dexterity saving throw or take 1d6 acid damage.",
    "upgrade": "\tThis spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6)",
    "level": 0
  },
  {
    "name": "Chill Touch",
    "school": "Necromancy",
    "casting time": "1 action",
    "ritual": "no",
    "range": "120 feet",
    "target": "",
    "components": "V, S",
    "duration": "1 round",
    "saving throw": "",
    "concentration": "no",
    "description": "\tYou create a ghostly, skeletal hand in the space of a creature within range.\n\tMake a ranged spell attack against the creature to assail it with the chill of the grave.\n\tOn a hit, the target takes 1d8 necrotic damage, and it can’t regain hit points until the start of your next turn.\n\tUntil then, the hand clings to the target.\n\tIf you hit an undead target, it also has disadvantage on attack rolls against you until the end of your next turn.",
    "upgrade": "\tThis spell’s damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
    "level": 0
  },
  {
    "name": "Dancing Lights",
    "school": "Evocation",
    "casting time": "1 action",
    "ritual": "no",
    "range": "120 feet",
    "target": "",
    "components": "V, S, M (a bit of phosphorous or wychwood, or a glowworm)",
    "duration": "Concentration, up to a minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "\tYou create up to four torch-sized lights within range, making them appear as torches, lanterns, or glowing orbs that hover in the air for the duration.\n\tYou can also combine the four lights into one glowing vaguely humanoid form of Medium size.\n\tWhichever form you choose, each light sheds dim light in a 10-foot radius.\n\tAs a bonus action on your turn, you can move the lights up to 60 feet to a new spot within range.\n\tA light must be within 20 feet of another light created by this spell, and a light winks out if it exceeds the spell’s range.",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Fire Bolt",
    "school": "Evocation",
    "casting time": "1 action",
    "ritual": "",
    "range": "120 feet",
    "target": "creature or object",
    "components": "V, S",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "\tYou hurl a mote of fire at a creature or object within range.\n\tMake a ranged spell attack against the target.\n\tOn a hit, the target takes 1d10 fire damage.\n\tA flammable object hit by this spell ignites if it isn't being worn or carried.",
    "upgrade": "\tThis spell's damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10)",
    "level": 0
  },
  {
    "name": "Light",
    "school": "Evocation",
    "casting time": "1 action",
    "ritual": "",
    "range": "Touch",
    "target": "",
    "components": "V, M (a firefly or phosphorescent moss)",
    "duration": "1 hour",
    "saving throw": "",
    "concentration": "",
    "description": "\nYou touch one object that is no larger than 10 feet in any dimension.\n\tUntil the spell ends, the object sheds bright light in a 20-foot radius and dim light for an additional 20 feet.\n\tThe light cant be colored as you like.\n\tCompletely covering the object with something opaque blocks the light.\n\tThe spell ends if you cast it again or dismiss it as an action.\n\tIf you target an object held or worn by a hostile creature, that creature must succeed on a Dexterity saving throw to avoid the spell",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Mage Hand",
    "school": "Conjuration",
    "casting time": "1 Action",
    "ritual": "",
    "range": "30 feet",
    "target": "",
    "components": "V, S",
    "duration": "1 minute",
    "saving throw": "",
    "concentration": "",
    "description": "\tA spectral, floating hand appears at a point you choose within range.\n\tThe hand lasts for the duration or until you dismiss it as an action.\n\tThe hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again.\n\tYou can use your action to control the hand.\n\tYou can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a vial.\n\tYou can move the hand up to 30 feet each time you use it.\n\tThe hand can’t attack, activate magical items, or carry more than 10 pounds.\n\t",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Mending",
    "school": "Transmutation",
    "casting time": "1 Minute",
    "ritual": "",
    "range": "Touch",
    "target": "",
    "components": "V, S, M (two lodestones)",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "\tThis spell repairs a single break or tear in an object you touch, such as broken chain link, two halves of a broken key, a torn cloak, or a leaking wineskin.\n\tAs long as the break or tear is no larger than 1 foot in any dimension, you mend it, leaving no trace of the former damage.\n\tThis spell can physically repair a magic item or construct, but the spell can’t restore magic to such an object.",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Message",
    "school": "Transmutation",
    "casting time": "1 action",
    "ritual": "",
    "range": "120 feet",
    "target": "",
    "components": "V, S, M (a short piece of copper wire)",
    "duration": "1 round",
    "saving throw": "",
    "concentration": "",
    "description": "\tYou point your finger toward a creature within range and whisper a message.\n\tThe target (and only the target) hears the message and can reply in a whisper that only you can hear.\n\tYou can cast this spell through solid objects if you are familiar with the target and know it is beyond the barrier.\n\tMagical silence, 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood blocks the spell.\n\tThe spell doesn’t have to follow a straight line and can travel freely around corners or through openings.",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Minor Illusion",
    "school": "Illusion ",
    "casting time": "1 Action",
    "ritual": "",
    "range": "30 feet",
    "target": "",
    "components": "S, M (a bit of fleece)",
    "duration": "1 minute",
    "saving throw": "",
    "concentration": "",
    "description": "\tYou create a sound or an image of an object within range that lasts for the duration.\n\tThe illusion also ends if you dismiss it as an action or cast this spell again.\n\tIf you create a sound, its volume can range from a whisper to a scream.\n\tIt can be your voice, someone else’s voice, a lion’s roar, a beating of drums, or any other sound you choose.\n\tThe sound continues unabated throughout the duration, or you can make discrete sounds at different times before the spell ends.\n\tIf you create an image of an object—such as a chair, muddy footprints, or a small chest—it must be no larger than a 5-foot cube.\n\tThe image can’t create sound, light, smell, or any other sensory effect.\n\tPhysical interaction with the image reveals it to be an illusion, because things can pass through it.\n\tIf a creature uses its action to examine the sound or image, the creature can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC.\n\tIf a creature discerns the illusion for what it is, the illusion becomes faint to the creature.",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Poison Spray",
    "school": "Conjuration",
    "casting time": "1 Action",
    "ritual": "",
    "range": "10 feet",
    "target": "",
    "components": "V, S",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "\tYou extend your hand toward a creature you can see within range and project a puff of noxious gas from your palm.\n\tThe creature must succeed on a Constitution saving throw or take 1d12 poison damage.",
    "upgrade": "\tThis spell’s damage increases by 1d12 when you reach 5th level (2d12), 11th level (3d12), and 17th level (4d12)",
    "level": 0
  },
  {
    "name": "Prestidigitation",
    "school": "Transmutation",
    "casting time": "1 Action",
    "ritual": "",
    "range": "10 feet",
    "target": "",
    "components": "V, S",
    "duration": "Up to 1 hour",
    "saving throw": "",
    "concentration": "",
    "description": "\tThis spell is a minor magical trick that novice spellcasters use for practice.\n\tYou create one of the following magical effects within range:\n\t\tYou create an instantaneous, harmless sensory effect, such as a shower of sparks, a puff of wind, faint musical notes, or an odd odor. You instantaneously light or snuff out a candle, a torch, or a small campfire.\n\t\tYou instantaneously clean or soil an object no larger than 1 cubic foot.\n\t\tYou chill, warm, or flavor up to 1 cubic foot of nonliving material for 1 hour.\n\t\tYou make a color, a small mark, or a symbol appear on an object or a surface for 1 hour.\n\t\tYou create a non-magical trinket or an illusory image that can fit in your hand and that lasts until the end of your next turn.\n\t\tAt your DM's discretion, you may produce other effects with a similar level of power.\n\tIf you cast this spell multiple times, you can have up to three of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action.",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Ray of Frost",
    "school": "Evocation",
    "casting time": "1 action",
    "ritual": "",
    "range": "60 feet",
    "target": "",
    "components": "V, S",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "\tA frigid beam of blue-white light streaks toward a creature within range.\n\tMake a ranged spell attack against the target.\n\t On a hit, it takes 1d8 cold damage, and its speed is reduced by 10 feet until the start of your next turn.",
    "upgrade": "\tThe spell’s damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
    "level": 0
  },
  {
    "name": "Shocking Grasp",
    "school": "Evocation",
    "casting time": "1 action",
    "ritual": "",
    "range": "Touch",
    "target": "",
    "components": "V,S",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "\tLightning springs from your hand to deliver a shock to a creature you try to touch.\n\tMake a melee spell attack against the target.\n\tYou have advantage on the attack roll if the target is wearing armor made of metal.\n\tOn a hit, the target takes 1d8 lightning damage, and it can’t take reactions until the start of its next turn.",
    "upgrade": "\tThe spell’s damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
    "level": 0
  },
  {
    "name": "True Strike",
    "school": "Divination",
    "casting time": "1 Action",
    "ritual": "",
    "range": "30 feet",
    "target": "",
    "components": "S",
    "duration": "Concentration, up to 1 round",
    "saving throw": "",
    "concentration": "yes",
    "description": "\tYou extend your hand and point a finger at a target in range.\n\tYour magic grants you a brief insight into the target’s defenses.\n\tOn your next turn, you gain advantage on your first attack roll against the target, provided that this spell hasn’t ended",
    "upgrade": "",
    "level": 0
  }
]