[
  {
    "name": "Arcane Sword",
    "school": "Evocation",
    "classes": [
      "Bard",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": "no",
    "range": "60 feet",
    "target": "",
    "components": "V, S, M (A miniature platinum sword with a grip and pommel of copper and zinc, worth 250 gp.)",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "You create a sword-shaped plane of force that hovers within range. It lasts for the duration. When the sword appears, you make a melee spell attack against a target of your choice within 5 feet of the sword. On a hit, the target takes 3d10 force damage. Until the spell ends, you can use a bonus action on each of your turns to move the sword up to 20 feet to a spot you can see and repeat this attack against the same target or a different one.",
    "upgrade": "",
    "level": 7
  },
  {
    "name": "Conjure Celestial",
    "school": "Conjuration",
    "classes": [
      "Cleric"
    ],
    "casting time": "1 minute",
    "ritual": "no",
    "range": "90 feet",
    "target": "",
    "components": "V, S",
    "duration": "Up to 1 hour",
    "saving throw": "",
    "concentration": "yes",
    "description": "You summon a celestial of challenge rating 4 or lower, which appears in an unoccupied space that you can see within range. The celestial disappears when it drops to 0 hit points or when the spell ends. The celestial is friendly to you and your companions for the duration. Roll initiative for the celestial, which has its own turns. It obeys any verbal commands that you issue to it (no action required by you), as long as they don't violate its alignment. If you don't issue any commands to the celestial, it defends itself from hostile creatures but otherwise takes no actions. The DM has the celestial's statistics.",
    "upgrade": "When you cast this spell using a 9th-level spell slot, you summon a celestial of challenge rating 5 or lower.",
    "level": 7
  },
  {
    "name": "Delayed Blast Fireball",
    "school": "Evocation",
    "classes": [
      "Sorcerer",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": "no",
    "range": "150 feet",
    "target": "",
    "components": "V, S, M (A tiny ball of bat guano and sulfur.)",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "A beam of yellow light flashes from your pointing finger, then condenses to linger at a chosen point within range as a glowing bead for the duration. When the spell ends, either because your concentration is broken or because you decide to end it, the bead blossoms with a low roar into an explosion of flame that spreads around corners. Each creature in a 20-foot-radius sphere centered on that point must make a dexterity saving throw. A creature takes fire damage equal to the total accumulated damage on a failed save, or half as much damage on a successful one. The spell's base damage is 12d6. If at the end of your turn the bead has not yet detonated, the damage increases by 1d6. If the glowing bead is touched before the interval has expired, the creature touching it must make a dexterity saving throw. On a failed save, the spell ends immediately, causing the bead to erupt in flame. On a successful save, the creature can throw the bead up to 40 feet. When it strikes a creature or a solid object, the spell ends, and the bead explodes. The fire damages objects in the area and ignites flammable objects that aren't being worn or carried.",
    "upgrade": "When you cast this spell using a spell slot of 8th level or higher, the base damage increases by 1d6 for each slot level above 7th.",
    "level": 7
  },
  {
    "name": "Divine Word",
    "school": "Evocation",
    "classes": [
      "Cleric"
    ],
    "casting time": "1 bonus action",
    "ritual": "no",
    "range": "30 feet",
    "target": "",
    "components": "V",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "no",
    "description": "You utter a divine word, imbued with the power that shaped the world at the dawn of creation. Choose any number of creatures you can see within range. Each creature that can hear you must make a Charisma saving throw. On a failed save, a creature suffers an effect based on its current hit points: \n- 50hp or less: deafened for 1 minute \n- 40 hp or less: deafened and blinded for 10 minutes \n- 30 hp or less: blinded, deafened and dazed for 1 hour \n- 20 hp or less: killed instantly. Regardless of its current hit points, a celestial, an elemental, a fey, or a fiend that fails its save is forced back to its plane of origin (if it isn’t there already) and can’t return to your current plane for 24 hours by any means short of a wish spell.",
    "upgrade": "",
    "level": 7
  },
  {
    "name": "Etherealness",
    "school": "Transmutation",
    "classes": [
      "Bard",
      "Cleric",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": "no",
    "range": "Self",
    "target": "",
    "components": "V, S",
    "duration": "8 hours",
    "saving throw": "",
    "concentration": "no",
    "description": "You step into the border regions of the Ethereal Plane, in the area where it overlaps with your current plane. You remain in the Border Ethereal for the duration or until you use your action to dismiss the spell. During this time, you can move in any direction. If you move up or down, every foot of movement costs an extra foot. You can see and hear the plane you originated from, but everything there looks gray, and you can't see anything more than 60 feet away. While on the Ethereal Plane, you can only affect and be affected by other creatures on that plane. Creatures that aren't on the Ethereal Plane can't perceive you and can't interact with you, unless a special ability or magic has given them the ability to do so. You ignore all objects and effects that aren't on the Ethereal Plane, allowing you to move through objects you perceive on the plane you originated from. When the spell ends, you immediately return to the plane you originated from in the spot you currently occupy. If you occupy the same spot as a solid object or creature when this happens, you are immediately shunted to the nearest unoccupied space that you can occupy and take force damage equal to twice the number of feet you are moved. This spell has no effect if you cast it while you are on the Ethereal Plane or a plane that doesn't border it, such as one of the Outer Planes.",
    "upgrade": "When you cast this spell using a spell slot of 8th level or higher, you can target up to three willing creatures (including you) for each slot level above 7th. The creatures must be within 10 feet of you when you cast the spell.",
    "level": 7
  },
  {
    "name": "Finger of Death",
    "school": "Necromancy",
    "classes": [
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": "no",
    "range": "60 feet",
    "target": "",
    "components": "V, S",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "no",
    "description": "You send negative energy coursing through a creature that you can see within range, causing it searing pain. The target must make a constitution saving throw. It takes 7d8 + 30 necrotic damage on a failed save, or half as much damage on a successful one. A humanoid killed by this spell rises at the start of your next turn as a zombie that is permanently under your command, following your verbal orders to the best of its ability.",
    "upgrade": "",
    "level": 7
  },
  {
    "name": "Fire Storm",
    "school": "Evocation",
    "classes": [
      "Cleric",
      "Druid",
      "Sorcerer"
    ],
    "casting time": "1 action",
    "ritual": "no",
    "range": "150 feet",
    "target": "",
    "components": "V, S",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "no",
    "description": "A storm made up of sheets of roaring flame appears in a location you choose within range. The area of the storm consists of up to ten 10-foot cubes, which you can arrange as you wish. Each cube must have at least one face adjacent to the face of another cube. Each creature in the area must make a dexterity saving throw. It takes 7d10 fire damage on a failed save, or half as much damage on a successful one. The fire damages objects in the area and ignites flammable objects that aren't being worn or carried. If you choose, plant life in the area is unaffected by this spell.",
    "upgrade": "",
    "level": 7
  },
  {
    "name": "Forcecage",
    "school": "Evocation",
    "classes": [
      "Bard",
      "Warlock",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": "no",
    "range": "100 feet",
    "target": "",
    "components": "V, S, M (Ruby dust worth 1,500 gp.)",
    "duration": "1 hour",
    "saving throw": "",
    "concentration": "no",
    "description": "An immobile, invisible, cube-shaped prison composed of magical force springs into existence around an area you choose within range. The prison can be a cage or a solid box, as you choose. A prison in the shape of a cage can be up to 20 feet on a side and is made from 1/2-inch diameter bars spaced 1/2 inch apart. A prison in the shape of a box can be up to 10 feet on a side, creating a solid barrier that prevents any matter from passing through it and blocking any spells cast into or out from the area. When you cast the spell, any creature that is completely inside the cage's area is trapped. Creatures only partially within the area, or those too large to fit inside the area, are pushed away from the center of the area until they are completely outside the area. A creature inside the cage can't leave it by nonmagical means. If the creature tries to use teleportation or interplanar travel to leave the cage, it must first make a charisma saving throw. On a success, the creature can use that magic to exit the cage. On a failure, the creature can't exit the cage and wastes the use of the spell or effect. The cage also extends into the Ethereal Plane, blocking ethereal travel. This spell can't be dispelled by dispel magic.",
    "upgrade": "",
    "level": 7
  },
  {
    "name": "Magnificent Mansion",
    "school": "Conjuration",
    "classes": [
      "Bard",
      "Wizard"
    ],
    "casting time": "1 minute",
    "ritual": "no",
    "range": "300 feet",
    "target": "",
    "components": "V, S, M (A miniature portal carved from ivory, a small piece of polished marble, and a tiny silver spoon, each item worth at least 5 gp.)",
    "duration": "24 hours",
    "saving throw": "",
    "concentration": "no",
    "description": "You conjure an extradimensional dwelling in range that lasts for the duration. You choose where its one entrance is located. The entrance shimmers faintly and is 5 feet wide and 10 feet tall. You and any creature you designate when you cast the spell can enter the extradimensional dwelling as long as the portal remains open. You can open or close the portal if you are within 30 feet of it. While closed, the portal is invisible. Beyond the portal is a magnificent foyer with numerous chambers beyond. The atmosphere is clean, fresh, and warm. You can create any floor plan you like, but the space can't exceed 50 cubes, each cube being 10 feet on each side. The place is furnished and decorated as you choose. It contains sufficient food to serve a nine course banquet for up to 100 people. A staff of 100 near-transparent servants attends all who enter. You decide the visual appearance of these servants and their attire. They are completely obedient to your orders. Each servant can perform any task a normal human servant could perform, but they can't attack or take any action that would directly harm another creature. Thus the servants can fetch things, clean, mend, fold clothes, light fires, serve food, pour wine, and so on. The servants can go anywhere in the mansion but can't leave it. Furnishings and other objects created by this spell dissipate into smoke if removed from the mansion. When the spell ends, any creatures inside the extradimensional space are expelled into the open spaces nearest to the entrance.",
    "upgrade": "",
    "level": 7
  },
  {
    "name": "Mirage Arcane",
    "school": "Illusion",
    "classes": [
      "Bard",
      "Druid",
      "Wizard"
    ],
    "casting time": "10 minutes",
    "ritual": "no",
    "range": "Sight",
    "target": "",
    "components": "V, S",
    "duration": "10 days",
    "saving throw": "",
    "concentration": "no",
    "description": "You make terrain in an area up to 1 mile square look, sound, smell, and even feel like some other sort of terrain. The terrain's general shape remains the same, however. Open fields or a road could be made to resemble a swamp, hill, crevasse, or some other difficult or impassable terrain. A pond can be made to seem like a grassy meadow, a precipice like a gentle slope, or a rock-strewn gully like a wide and smooth road. Similarly, you can alter the appearance of structures, or add them where none are present. The spell doesn't disguise, conceal, or add creatures. The illusion includes audible, visual, tactile, and olfactory elements, so it can turn clear ground into difficult terrain (or vice versa) or otherwise impede movement through the area. Any piece of the illusory terrain (such as a rock or stick) that is removed from the spell's area disappears immediately. Creatures with truesight can see through the illusion to the terrain's true form; however, all other elements of the illusion remain, so while the creature is aware of the illusion's presence, the creature can still physically interact with the illusion.",
    "upgrade": "",
    "level": 7
  },
  {
    "name": "Plane Shift",
    "school": "Conjuration",
    "classes": [
      "Cleric",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": "no",
    "range": "Touch",
    "target": "",
    "components": "V, S, M (A forked, metal rod worth at least 250 gp, attuned to a particular plane of existence.)",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "no",
    "description": "You and up to eight willing creatures who link hands in a circle are transported to a different plane of existence. You can specify a target destination in general terms, such as the City of Brass on the Elemental Plane of Fire or the palace of Dispater on the second level of the Nine Hells, and you appear in or near that destination. If you are trying to reach the City of Brass, for example, you might arrive in its Street of Steel, before its Gate of Ashes, or looking at the city from across the Sea of Fire, at the DM's discretion. Alternatively, if you know the sigil sequence of a teleportation circle on another plane of existence, this spell can take you to that circle. If the teleportation circle is too small to hold all the creatures you transported, they appear in the closest unoccupied spaces next to the circle. You can use this spell to banish an unwilling creature to another plane. Choose a creature within your reach and make a melee spell attack against it. On a hit, the creature must make a charisma saving throw. If the creature fails this save, it is transported to a random location on the plane of existence you specify. A creature so transported must find its own way back to your current plane of existence.",
    "upgrade": "",
    "level": 7
  },
  {
    "name": "Prismatic Spray",
    "school": "Evocation",
    "classes": [
      "Sorcerer",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": "no",
    "range": "Self",
    "target": "",
    "components": "V, S",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "no",
    "description": "Eight multicolored rays of light flash from your hand. Each ray is a different color and has a different power and purpose. Each creature in a 60-foot cone must make a dexterity saving throw. For each target, roll a d8 to determine which color ray affects it.\n\n**1. Red.** The target takes 10d6 fire damage on a failed save, or half as much damage on a successful one.\n\n**2. Orange.** The target takes 10d6 acid damage on a failed save, or half as much damage on a successful one.\n\n**3. Yellow.** The target takes 10d6 lightning damage on a failed save, or half as much damage on a successful one.\n\n**4. Green.** The target takes 10d6 poison damage on a failed save, or half as much damage on a successful one.\n\n**5. Blue.** The target takes 10d6 cold damage on a failed save, or half as much damage on a successful one.\n\n**6. Indigo.** On a failed save, the target is restrained. It must then make a constitution saving throw at the end of each of its turns. If it successfully saves three times, the spell ends. If it fails its save three times, it permanently turns to stone and is subjected to the petrified condition. The successes and failures don't need to be consecutive; keep track of both until the target collects three of a kind.\n\n**7. Violet.** On a failed save, the target is blinded. It must then make a wisdom saving throw at the start of your next turn. A successful save ends the blindness. If it fails that save, the creature is transported to another plane of existence of the DM's choosing and is no longer blinded. (Typically, a creature that is on a plane that isn't its home plane is banished home, while other creatures are usually cast into the Astral or Ethereal planes.) \n\n**8. Special.** The target is struck by two rays. Roll twice more, rerolling any 8.",
    "upgrade": "",
    "level": 7
  },
  {
    "name": "Project Image",
    "school": "Illusion",
    "classes": [
      "Bard",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": "no",
    "range": "500 miles",
    "target": "",
    "components": "V, S, M (A small replica of you made from materials worth at least 5 gp.)",
    "duration": "Up to 24 hours",
    "saving throw": "",
    "concentration": "yes",
    "description": "You create an illusory copy of yourself that lasts for the duration. The copy can appear at any location within range that you have seen before, regardless of intervening obstacles. The illusion looks and sounds like you but is intangible. If the illusion takes any damage, it disappears, and the spell ends. You can use your action to move this illusion up to twice your speed, and make it gesture, speak, and behave in whatever way you choose. It mimics your mannerisms perfectly. You can see through its eyes and hear through its ears as if you were in its space. On your turn as a bonus action, you can switch from using its senses to using your own, or back again. While you are using its senses, you are blinded and deafened in regard to your own surroundings. Physical interaction with the image reveals it to be an illusion, because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image, and any noise it makes sounds hollow to the creature.",
    "upgrade": "",
    "level": 7
  },
  {
    "name": "Regenerate",
    "school": "Transmutation",
    "classes": [
      "Bard",
      "Cleric",
      "Druid"
    ],
    "casting time": "1 minute",
    "ritual": "no",
    "range": "Touch",
    "target": "",
    "components": "V, S, M (A prayer wheel and holy water.)",
    "duration": "1 hour",
    "saving throw": "",
    "concentration": "no",
    "description": "You touch a creature and stimulate its natural healing ability. The target regains 4d8 + 15 hit points. For the duration of the spell, the target regains 1 hit point at the start of each of its turns (10 hit points each minute). The target's severed body members (fingers, legs, tails, and so on), if any, are restored after 2 minutes. If you have the severed part and hold it to the stump, the spell instantaneously causes the limb to knit to the stump.",
    "upgrade": "",
    "level": 7
  },
  {
    "name": "Resurrection",
    "school": "Necromancy",
    "classes": [
      "Bard",
      "Cleric"
    ],
    "casting time": "1 hour",
    "ritual": "no",
    "range": "Touch",
    "target": "",
    "components": "V, S, M (A diamond worth at least 1,000gp, which the spell consumes.)",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "no",
    "description": "You touch a dead creature that has been dead for no more than a century, that didn't die of old age, and that isn't undead. If its soul is free and willing, the target returns to life with all its hit points. This spell neutralizes any poisons and cures normal diseases afflicting the creature when it died. It doesn't, however, remove magical diseases, curses, and the like; if such effects aren't removed prior to casting the spell, they afflict the target on its return to life. This spell closes all mortal wounds and restores any missing body parts. Coming back from the dead is an ordeal. The target takes a -4 penalty to all attack rolls, saving throws, and ability checks. Every time the target finishes a long rest, the penalty is reduced by 1 until it disappears. Casting this spell to restore life to a creature that has been dead for one year or longer taxes you greatly. Until you finish a long rest, you can't cast spells again, and you have disadvantage on all attack rolls, ability checks, and saving throws.",
    "upgrade": "",
    "level": 7
  },
  {
    "name": "Reverse Gravity",
    "school": "Transmutation",
    "classes": [
      "Druid",
      "Sorcerer",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": "no",
    "range": "100 feet",
    "target": "",
    "components": "V, S, M (A lodestone and iron filings.)",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "This spell reverses gravity in a 50-foot-radius, 100-foot high cylinder centered on a point within range. All creatures and objects that aren't somehow anchored to the ground in the area fall upward and reach the top of the area when you cast this spell. A creature can make a dexterity saving throw to grab onto a fixed object it can reach, thus avoiding the fall. If some solid object (such as a ceiling) is encountered in this fall, falling objects and creatures strike it just as they would during a normal downward fall. If an object or creature reaches the top of the area without striking anything, it remains there, oscillating slightly, for the duration. At the end of the duration, affected objects and creatures fall back down.",
    "upgrade": "",
    "level": 7
  },
  {
    "name": "Sequester",
    "school": "Transmutation",
    "classes": [
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": "no",
    "range": "Touch",
    "target": "",
    "components": "V, S, M (A powder composed of diamond, emerald, ruby, and sapphire dust worth at least 5,000 gp, which the spell consumes.)",
    "duration": "Until dispelled",
    "saving throw": "",
    "concentration": "no",
    "description": "By means of this spell, a willing creature or an object can be hidden away, safe from detection for the duration. When you cast the spell and touch the target, it becomes invisible and can't be targeted by divination spells or perceived through scrying sensors created by divination spells. If the target is a creature, it falls into a state of suspended animation. Time ceases to flow for it, and it doesn't grow older. You can set a condition for the spell to end early. The condition can be anything you choose, but it must occur or be visible within 1 mile of the target. Examples include \"after 1,000 years\" or \"when the tarrasque awakens.\" This spell also ends if the target takes any damage.",
    "upgrade": "",
    "level": 7
  },
  {
    "name": "Simulacrum",
    "school": "Illusion",
    "classes": [
      "Wizard"
    ],
    "casting time": "12 hours",
    "ritual": "no",
    "range": "Touch",
    "target": "",
    "components": "V, S, M (Snow or ice in quantities sufficient to made a life-size copy of the duplicated creature; some hair, fingernail clippings, or other piece of that creature's body placed inside the snow or ice; and powdered ruby worth 1,500 gp, sprinkled over the duplicate and consumed by the spell.)",
    "duration": "Until dispelled",
    "saving throw": "",
    "concentration": "no",
    "description": "You shape an illusory duplicate of one beast or humanoid that is within range for the entire casting time of the spell. The duplicate is a creature, partially real and formed from ice or snow, and it can take actions and otherwise be affected as a normal creature. It appears to be the same as the original, but it has half the creature's hit point maximum and is formed without any equipment. Otherwise, the illusion uses all the statistics of the creature it duplicates. The simulacrum is friendly to you and creatures you designate. It obeys your spoken commands, moving and acting in accordance with your wishes and acting on your turn in combat. The simulacrum lacks the ability to learn or become more powerful, so it never increases its level or other abilities, nor can it regain expended spell slots. If the simulacrum is damaged, you can repair it in an alchemical laboratory, using rare herbs and minerals worth 100 gp per hit point it regains. The simulacrum lasts until it drops to 0 hit points, at which point it reverts to snow and melts instantly. If you cast this spell again, any currently active duplicates you created with this spell are instantly destroyed.",
    "upgrade": "",
    "level": 7
  },
  {
    "name": "Symbol",
    "school": "Abjuration",
    "classes": [
      "Bard",
      "Cleric",
      "Wizard"
    ],
    "casting time": "1 minute",
    "ritual": "no",
    "range": "Touch",
    "target": "",
    "components": "V, S, M (Mercury, phosphorus, and powdered diamond and opal with a total value of at least 1,000 gp, which the spell consumes.)",
    "duration": "Until dispelled or triggered",
    "saving throw": "",
    "concentration": "no",
    "description": "When you cast this spell, you inscribe a harmful glyph either on a surface (such as a section of floor, a wall, or a table) or within an object that can be closed to conceal the glyph (such as a book, a scroll, or a treasure chest). If you choose a surface, the glyph can cover an area of the surface no larger than 10 feet in diameter. If you choose an object, that object must remain in its place; if the object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered. The glyph is nearly invisible, requiring an Intelligence (Investigation) check against your spell save DC to find it. You decide what triggers the glyph when you cast the spell. For glyphs inscribed on a surface, the most typical triggers include touching or stepping on the glyph, removing another object covering it, approaching within a certain distance of it, or manipulating the object that holds it. For glyphs inscribed within an object, the most common triggers are opening the object, approaching within a certain distance of it, or seeing or reading the glyph. You can further refine the trigger so the spell is activated only under certain circumstances or according to a creature's physical characteristics (such as height or weight), or physical kind (for example, the ward could be set to affect hags or shapechangers). You can also specify creatures that don't trigger the glyph, such as those who say a certain password. When you inscribe the glyph, choose one of the options below for its effect. Once triggered, the glyph glows, filling a 60-foot-radius sphere with dim light for 10 minutes, after which time the spell ends. Each creature in the sphere when the glyph activates is targeted by its effect, as is a creature that enters the sphere for the first time on a turn or ends its turn there.\n\n**Death.** Each target must make a constitution saving throw, taking 10d 10 necrotic damage on a failed save, or half as much damage on a successful save\n\n **Discord.** Each target must make a constitution saving throw. On a failed save, a target bickers and argues with other creatures for 1 minute. During this time, it is incapable of meaningful communication and has disadvantage on attack rolls and ability checks.\n\n**Fear.** Each target must make a wisdom saving throw and becomes frightened for 1 minute on a failed save. While frightened, the target drops whatever it is holding and must move at least 30 feet away from the glyph on each of its turns, if able.\n\n**Hopelessness.** Each target must make a charisma saving throw. On a failed save, the target is overwhelmed with despair for 1 minute. During this time, it can't attack or target any creature with harmful abilities, spells, or other magical effects.\n\n**Insanity.** Each target must make an intelligence saving throw. On a failed save, the target is driven insane for 1 minute. An insane creature can't take actions, can't understand what other creatures say, can't read, and speaks only in gibberish. The DM controls its movement, which is erratic.\n\n**Pain.** Each target must make a constitution saving throw and becomes incapacitated with excruciating pain for 1 minute on a failed save.\n\n**Sleep.** Each target must make a wisdom saving throw and falls unconscious for 10 minutes on a failed save. A creature awakens if it takes damage or if someone uses an action to shake or slap it awake.\n\n**Stunning.** Each target must make a wisdom saving throw and becomes stunned for 1 minute on a failed save.",
    "upgrade": "",
    "level": 7
  },
  {
    "name": "Teleport",
    "school": "Conjuration",
    "classes": [
      "Bard",
      "Sorcerer",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": "no",
    "range": "10 feet",
    "target": "",
    "components": "V",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "no",
    "description": "This spell instantly transports you and up to eight willing creatures of your choice that you can see within range, or a single object that you can see within range, to a destination you select. If you target an object, it must be able to fit entirely inside a 10-foot cube, and it can't be held or carried by an unwilling creature. The destination you choose must be known to you, and it must be on the same plane of existence as you. Your familiarity with the destination determines whether you arrive there successfully. The DM rolls d100 and consults the table.\n\n**Familiarity.** \"Permanent circle\" means a permanent teleportation circle whose sigil sequence you know. \"Associated object\" means that you possess an object taken from the desired destination within the last six months, such as a book from a wizard’s library, bed linen from a royal suite, or a chunk of marble from a lich’s secret tomb. \"Very familiar\" is a place you have been very often, a place you have carefully studied, or a place you can see when you cast the spell. \"Seen casually\" is someplace you have seen more than once but with which you aren’t very familiar. \"Viewed once\" is a place you have seen once, possibly using magic. \"Description\" is a place whose location and appearance you know through someone else’s description, perhaps from a map. \"False destination\" is a place that doesn’t exist. Perhaps you tried to scry an enemy’s sanctum but instead viewed an illusion, or you are attempting to teleport to a familiar location that no longer exists.\n\n**On Target.** You and your group (or the target object) appear where you want to.\n\n**Off Target.** You and your group (or the target object) appear a random distance away from the destination in a random direction. Distance off target is 1d10 × 1d10 percent of the distance that was to be traveled. For example, if you tried to travel 120 miles, landed off target, and rolled a 5 and 3 on the two d10s, then you would be off target by 15 percent, or 18 miles. The GM determines the direction off target randomly by rolling a d8 and designating 1 as north, 2 as northeast, 3 as east, and so on around the points of the compass. If you were teleporting to a coastal city and wound up 18 miles out at sea, you could be in trouble.\n\n**Similar Area.** You and your group (or the target object) wind up in a different area that’s visually or thematically similar to the target area. If you are heading for your home laboratory, for example, you might wind up in another wizard’s laboratory or in an alchemical supply shop that has many of the same tools and implements as your laboratory. Generally, you appear in the closest similar place, but since the spell has no range limit, you could conceivably wind up anywhere on the plane.\n\n**Mishap.** The spell’s unpredictable magic results in a difficult journey. Each teleporting creature (or the target object) takes 3d10 force damage, and the GM rerolls on the table to see where you wind up (multiple mishaps can occur, dealing damage each time).",
    "upgrade": "",
    "level": 7
  }
]
