[
  {
    "name": "Acid Splash",
    "school": "Conjuration",
    "classes":["Sorcerer", "Wizard"],
    "casting time": "1 action",
    "ritual": "no",
    "range": "60 ft",
    "target": "single",
    "components": "V, S",
    "duration": "instantaneous",
    "saving throw": "No",
    "concentration": "No",
    "description": "You hurl a bubble of acid. Choose one creature within range, or choose two creatures within range that are within 5 feet of each other. A target must succeed on a Dexterity saving throw or take 1d6 acid damage.",
    "upgrade": "This spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6)",
    "level": 0
  },
  {
    "name": "Chill Touch",
    "school": "Necromancy",
    "classes":["Sorcerer", "Warlock", "Wizard"],
    "casting time": "1 action",
    "ritual": "no",
    "range": "120 feet",
    "target": "",
    "components": "V, S",
    "duration": "1 round",
    "saving throw": "",
    "concentration": "no",
    "description": "You create a ghostly, skeletal hand in the space of a creature within range. Make a ranged spell attack against the creature to assail it with the chill of the grave. On a hit, the target takes 1d8 necrotic damage, and it can’t regain hit points until the start of your next turn. Until then, the hand clings to the target. If you hit an undead target, it also has disadvantage on attack rolls against you until the end of your next turn.",
    "upgrade": "This spell’s damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
    "level": 0
  },
  {
    "name": "Dancing Lights",
    "school": "Evocation",
    "classes":["Bard", "Sorcerer", "Wizard"],
    "casting time": "1 action",
    "ritual": "no",
    "range": "120 feet",
    "target": "",
    "components": "V, S, M (a bit of phosphorous or wychwood, or a glowworm)",
    "duration": "Concentration, up to a minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "You create up to four torch-sized lights within range, making them appear as torches, lanterns, or glowing orbs that hover in the air for the duration. You can also combine the four lights into one glowing vaguely humanoid form of Medium size. Whichever form you choose, each light sheds dim light in a 10-foot radius. As a bonus action on your turn, you can move the lights up to 60 feet to a new spot within range. A light must be within 20 feet of another light created by this spell, and a light winks out if it exceeds the spell’s range.",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Druidcraft",
    "school": "Transmutation",
    "classes":["Druid"],
    "casting time": "1 action",
    "ritual": "",
    "range": "30 feet",
    "target": "",
    "components": "V, S",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "Whispering to the spirits of nature, you create one of the following effects within range:    You create a tiny, harmless sensory effect that predicts what the weather will be at your location for the next 24 hours. The effect might manifest as a golden orb for clear skies, a cloud for rain, falling snowflakes for snow, and so on. This effect persists for 1 round.    You instantly make a flower blossom, a seed pod open, or a leaf bud bloom.    You create an instantaneous, harmless sensory effect, such as falling leaves, a puff of wind, the sound of a small animal, or the faint odor of skunk. The effect must fit in a 5-AD‐‑foot cube.    You instantly light or snuff out a candle, a torch, or a small campfire.",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Produce Flame",
    "school": "Conjuration",
    "classes":["Druid"],
    "casting time": "1 action",
    "ritual": "",
    "range": "Self",
    "target": "",
    "components": "V, S",
    "duration": "10 minutes",
    "saving throw": "",
    "concentration": "",
    "description": "A flickering flame appears in your hand. The flame remains there for the duration and harms neither you nor your equipment. The flame sheds bright light in a 10-foot radius and dim light for an additional 10 feet. The spell ends if you dismiss it as an action or if you cast it again. You can also attack with the flame, although doing so ends the spell. When you cast this spell, or as an action on a later turn, you can hurl the flame at a creature within 30 feet of you. Make a ranged spell attack. On a hit, the target takes 1d8 fire damage. This spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Resistance",
    "school": "Abjuration",
    "classes":["Druid", "Cleric"],
    "casting time": "1 action",
    "ritual": "",
    "range": "Touch",
    "target": "",
    "components": "V, S, M (A miniature cloak.)",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "",
    "description": "You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one saving throw of its choice. It can roll the die before or after making the saving throw. The spell then ends.",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Shillelagh",
    "school": "Transmutation",
    "classes":["Druid"],
    "casting time": "1 bonus action",
    "ritual": "",
    "range": "Touch",
    "target": "",
    "components": "V, S, M (Mistletoe, a shamrock leaf, and a club or quarterstaff.)",
    "duration": "1 minute",
    "saving throw": "",
    "concentration": "",
    "description": "The wood of a club or a quarterstaff you are holding is imbued with nature's power. For the duration, you can use your spellcasting ability instead of Strength for the attack and damage rolls of melee attacks using that weapon, and the weapon's damage die becomes a d8. The weapon also becomes magical, if it isn't already. The spell ends if you cast it again or if you let go of the weapon.",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Fire Bolt",
    "school": "Evocation",
    "classes":["Sorcerer", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "120 feet",
    "target": "creature or object",
    "components": "V, S",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "You hurl a mote of fire at a creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 fire damage. A flammable object hit by this spell ignites if it isn't being worn or carried.",
    "upgrade": "This spell's damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10)",
    "level": 0
  },
  {
    "name": "Light",
    "school": "Evocation",
    "classes":["Bard", "Cleric", "Sorcerer", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "Touch",
    "target": "",
    "components": "V, M (a firefly or phosphorescent moss)",
    "duration": "1 hour",
    "saving throw": "",
    "concentration": "",
    "description": "You touch one object that is no larger than 10 feet in any dimension. Until the spell ends, the object sheds bright light in a 20-foot radius and dim light for an additional 20 feet. The light cant be colored as you like. Completely covering the object with something opaque blocks the light. The spell ends if you cast it again or dismiss it as an action. If you target an object held or worn by a hostile creature, that creature must succeed on a Dexterity saving throw to avoid the spell",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Mage Hand",
    "school": "Conjuration",
    "classes":["Bard", "Sorcerer", "Warlock", "Wizard"],
    "casting time": "1 Action",
    "ritual": "",
    "range": "30 feet",
    "target": "",
    "components": "V, S",
    "duration": "1 minute",
    "saving throw": "",
    "concentration": "",
    "description": "A spectral, floating hand appears at a point you choose within range. The hand lasts for the duration or until you dismiss it as an action. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again. You can use your action to control the hand. You can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a vial. You can move the hand up to 30 feet each time you use it. The hand can’t attack, activate magical items, or carry more than 10 pounds. ",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Mending",
    "school": "Transmutation",
    "classes":["Cleric", "Bard", "Druid", "Sorcerer", "Wizard"],
    "casting time": "1 Minute",
    "ritual": "",
    "range": "Touch",
    "target": "",
    "components": "V, S, M (two lodestones)",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "This spell repairs a single break or tear in an object you touch, such as broken chain link, two halves of a broken key, a torn cloak, or a leaking wineskin. As long as the break or tear is no larger than 1 foot in any dimension, you mend it, leaving no trace of the former damage. This spell can physically repair a magic item or construct, but the spell can’t restore magic to such an object.",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Message",
    "school": "Transmutation",
    "classes":["Bard", "Sorcerer", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "120 feet",
    "target": "",
    "components": "V, S, M (a short piece of copper wire)",
    "duration": "1 round",
    "saving throw": "",
    "concentration": "",
    "description": "You point your finger toward a creature within range and whisper a message. The target (and only the target) hears the message and can reply in a whisper that only you can hear. You can cast this spell through solid objects if you are familiar with the target and know it is beyond the barrier. Magical silence, 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood blocks the spell. The spell doesn’t have to follow a straight line and can travel freely around corners or through openings.",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Minor Illusion",
    "school": "Illusion ",
    "classes":["Bard", "Sorcerer", "Warlock", "Wizard"],
    "casting time": "1 Action",
    "ritual": "",
    "range": "30 feet",
    "target": "",
    "components": "S, M (a bit of fleece)",
    "duration": "1 minute",
    "saving throw": "",
    "concentration": "",
    "description": "You create a sound or an image of an object within range that lasts for the duration. The illusion also ends if you dismiss it as an action or cast this spell again. If you create a sound, its volume can range from a whisper to a scream. It can be your voice, someone else’s voice, a lion’s roar, a beating of drums, or any other sound you choose. The sound continues unabated throughout the duration, or you can make discrete sounds at different times before the spell ends. If you create an image of an object—such as a chair, muddy footprints, or a small chest—it must be no larger than a 5-foot cube. The image can’t create sound, light, smell, or any other sensory effect. Physical interaction with the image reveals it to be an illusion, because things can pass through it. If a creature uses its action to examine the sound or image, the creature can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the illusion becomes faint to the creature.",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Poison Spray",
    "school": "Conjuration",
    "classes":["Druid", "Sorcerer", "Warlock", "Wizard"],
    "casting time": "1 Action",
    "ritual": "",
    "range": "10 feet",
    "target": "",
    "components": "V, S",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "You extend your hand toward a creature you can see within range and project a puff of noxious gas from your palm. The creature must succeed on a Constitution saving throw or take 1d12 poison damage.",
    "upgrade": "This spell’s damage increases by 1d12 when you reach 5th level (2d12), 11th level (3d12), and 17th level (4d12)",
    "level": 0
  },
  {
    "name": "Prestidigitation",
    "school": "Transmutation",
    "classes":["Bard", "Sorcerer", "Warlock", "Wizard"],
    "casting time": "1 Action",
    "ritual": "",
    "range": "10 feet",
    "target": "",
    "components": "V, S",
    "duration": "Up to 1 hour",
    "saving throw": "",
    "concentration": "",
    "description": "This spell is a minor magical trick that novice spellcasters use for practice. You create one of the following magical effects within range:. You create an instantaneous, harmless sensory effect, such as a shower of sparks, a puff of wind, faint musical notes, or an odd odor. You instantaneously light or snuff out a candle, a torch, or a small campfire. . You instantaneously clean or soil an object no larger than 1 cubic foot. . You chill, warm, or flavor up to 1 cubic foot of nonliving material for 1 hour. . You make a color, a small mark, or a symbol appear on an object or a surface for 1 hour. . You create a non-magical trinket or an illusory image that can fit in your hand and that lasts until the end of your next turn. . At your DM's discretion, you may produce other effects with a similar level of power. If you cast this spell multiple times, you can have up to three of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action.",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Ray of Frost",
    "school": "Evocation",
    "classes":["Sorcerer", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "60 feet",
    "target": "",
    "components": "V, S",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "A frigid beam of blue-white light streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, it takes 1d8 cold damage, and its speed is reduced by 10 feet until the start of your next turn.",
    "upgrade": "The spell’s damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
    "level": 0
  },
  {
    "name": "Shocking Grasp",
    "school": "Evocation",
    "classes":["Sorcerer", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "Touch",
    "target": "",
    "components": "V,S",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "Lightning springs from your hand to deliver a shock to a creature you try to touch. Make a melee spell attack against the target. You have advantage on the attack roll if the target is wearing armor made of metal. On a hit, the target takes 1d8 lightning damage, and it can’t take reactions until the start of its next turn.",
    "upgrade": "The spell’s damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
    "level": 0
  },
  {
    "name": "True Strike",
    "school": "Divination",
    "classes":["Bard", "Sorcerer", "Warlock", "Wizard"],
    "casting time": "1 Action",
    "ritual": "",
    "range": "30 feet",
    "target": "",
    "components": "S",
    "duration": "Concentration, up to 1 round",
    "saving throw": "",
    "concentration": "yes",
    "description": "You extend your hand and point a finger at a target in range. Your magic grants you a brief insight into the target’s defenses. On your next turn, you gain advantage on your first attack roll against the target, provided that this spell hasn’t ended",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Guidance",
    "school": "Divination",
    "classes": ["Cleric", "Druid"],
    "casting time": "1 action",
    "ritual": "",
    "range": "Touch",
    "target": "",
    "components": "V, S",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one ability check of its choice. It can roll the die before or after making the ability check. The spell then ends.",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Sacredd Flame",
    "school": "Evocation",
    "classes": ["Cleric"],
    "casting time": "1 action",
    "ritual": "",
    "range": "60 feet",
    "target": "",
    "components": "V, S",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "Flame-like radiance descends on a creature that you can see within range. The target must succeed on a dexterity saving throw or take 1d8 radiant damage. The target gains no benefit from cover for this saving throw. The spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Spare the Dying",
    "school": "Necromancy",
    "classes": ["Cleric"],
    "casting time": "1 action",
    "ritual": "",
    "range": "Touch",
    "target": "",
    "components": "V,S",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "You touch a living creature that has 0 hit points. The creature becomes stable. This spell has no effect on undead or constructs.",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Thaumaturgy",
    "school": "Transmutation",
    "classes": ["Cleric"],
    "casting time": "1 action",
    "ritual": "",
    "range": "30 feet",
    "target": "",
    "components": "V",
    "duration": "1 minute",
    "saving throw": "",
    "concentration": "",
    "description": "You manifest a minor wonder, a sign of supernatural power, within range. You create one of the following magical effects within range. Your voice booms up to three times as loud as normal for 1 minute. You cause flames to flicker, brighten, dim, or change color for 1 minute. You cause harmless tremors in the ground for 1 minute. You create an instantaneous sound that originates from a point of your choice within range, such as a rumble of thunder, the cry of a raven, or ominous whispers. You instantaneously cause an unlocked door or window to fly open or slam shut. You alter the appearance of your eyes for 1 minute. If you cast this spell multiple times, you can have up to three of its 1-minute effects active at a time, and you can dismiss such an effect as an action.",
    "upgrade": "",
    "level": 0
  }
]