[
  {
    "name": "Acid Arrow",
    "school": "Evocation",
    "classes":["Druid", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "90 feet",
    "target": "one target",
    "components": "V, S, M (Powdered rhubarb leaf and an adder's stomach.)",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "A shimmering green arrow streaks toward a target within range and bursts in a spray of acid. Make a ranged spell attack against the target. On a hit, the target takes 4d4 acid damage immediately and 2d4 acid damage at the end of its next turn. On a miss, the arrow splashes the target with acid for half as much of the initial damage and no damage at the end of its next turn.",
    "upgrade": "When you cast this spell using a spell slot of 3rd level or higher, the damage (both initial and later) increases by 1d4 for each slot level above 2nd.",
    "level": 2
  },
  {
    "name": "Aid",
    "school": "Abjuration",
    "classes":["Cleric", "Paladin"],
    "casting time": "1 action",
    "ritual": "",
    "range": "30 feet",
    "target": "up to three creatures in range",
    "components": "V, S, M (A tiny strip of white cloth.)",
    "duration": "8 hours",
    "saving throw": "",
    "concentration": "",
    "description": "Your spell bolsters your allies with toughness and resolve. Choose up to three creatures within range. Each target's hit point maximum and current hit points increase by 5 for the duration.",
    "upgrade": "When you cast this spell using a spell slot of 3rd level or higher, a target's hit points increase by an additional 5 for each slot level above 2nd.",
    "level": 2
  },
  {
    "name": "Alter Self",
    "school": "Transmutation",
    "classes":["Sorcerer", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "self",
    "target": "",
    "components": "V,S",
    "duration": "Up to 1 hour",
    "saving throw": "",
    "concentration": "yes",
    "description": "You assume a different form. When you cast the spell, choose one of the following options, the effects of which last for the duration of the spell. While the spell lasts, you can end one option as an action to gain the benefits of a different one.Aquatic Adaptation. You adapt your body to an aquatic environment, sprouting gills and growing webbing between your fingers. You can breathe underwater and gain a swimming speed equal to your walking speed.Change Appearance. You transform your appearance. You decide what you look like, including your height, weight, facial features, sound of your voice, hair length, coloration, and distinguishing characteristics, if any. You can make yourself appear as a member of another race, though none of your statistics change. You also can't appear as a creature of a different size than you, and your basic shape stays the same; if you're bipedal, you can't use this spell to become quadrupedal, for instance. At any time for the duration of the spell, you can use your action to change your appearance in this way again.Natural Weapons. You grow claws, fangs, spines, horns, or a different natural weapon of your choice. Your unarmed strikes deal 1d6 bludgeoning, piercing, or slashing damage, as appropriate to the natural weapon you chose, and you are proficient with your unarmed strikes. Finally, the natural weapon is magic and you have a +1 bonus to the attack and damage rolls you make using it.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Animal Messenger",
    "school": "Enchantment",
    "classes":["Bard", "Druid", "Ranger", "Ritual Caster"],
    "casting time": "1 action",
    "ritual": "yes",
    "range": "30 feet",
    "target": "",
    "components": "V, S, M (A morsel of food.)",
    "duration": "24 hours",
    "saving throw": "",
    "concentration": "",
    "description": "By means of this spell, you use an animal to deliver a message. Choose a Tiny beast you can see within range, such as a squirrel, a blue jay, or a bat. You specify a location, which you must have visited, and a recipient who matches a general description, such as \"a man or woman dressed in the uniform of the town guard\" or \"a red-haired dwarf wearing a pointed hat.\" You also speak a message of up to twenty-five words. The target beast travels for the duration of the spell toward the specified location, covering about 50 miles per 24 hours for a flying messenger, or 25 miles for other animals.When the messenger arrives, it delivers your message to the creature that you described, replicating the sound of your voice. The messenger speaks only to a creature matching the description you gave. If the messenger doesn't reach its destination before the spell ends, the message is lost, and the beast makes its way back to where you cast this spell.",
    "upgrade": "If you cast this spell using a spell slot of 3nd level or higher, the duration of the spell increases by 48 hours for each slot level above 2nd.",
    "level": 2
  },
  {
    "name": "Arcane Lock",
    "school": "Abjuration",
    "classes":["Wizard"],
    "casting time": "1 action ",
    "ritual": "",
    "range": "Touch",
    "target": "",
    "components": "V, S, M (Gold dust worth at least 25gp, which the spell consumes.)",
    "duration": "Until dispelled ",
    "saving throw": "",
    "concentration": "",
    "description": "You touch a closed door, window, gate, chest, or other entryway, and it becomes locked for the duration. You and the creatures you designate when you cast this spell can open the object normally. You can also set a password that, when spoken within 5 feet of the object, suppresses this spell for 1 minute. Otherwise, it is impassable until it is broken or the spell is dispelled or suppressed. Casting knock on the object suppresses arcane lock for 10 minutes. While affected by this spell, the object is more difficult to break or force open; the DC to break it or pick any locks on it increases by 10.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Arcanist's Magic Aura",
    "school": "Illusion",
    "classes":["Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "",
    "target": "",
    "components": "V, S, M (A small square of silk.)",
    "duration": "24 hours ",
    "saving throw": "",
    "concentration": "",
    "description": "You place an illusion on a creature or an object you touch so that divination spells reveal false information about it. The target can be a willing creature or an object that isn't being carried or worn by another creature. When you cast the spell, choose one or both of the following effects. The effect lasts for the duration. If you cast this spell on the same creature or object every day for 30 days, placing the same effect on it each time, the illusion lasts until it is dispelled.False Aura. You change the way the target appears to spells and magical effects, such as detect magic, that detect magical auras. You can make a nonmagical object appear magical, a magical object appear nonmagical, or change the object's magical aura so that it appears to belong to a specific school of magic that you choose. When you use this effect on an object, you can make the false magic apparent to any creature that handles the item.Mask. You change the way the target appears to spells and magical effects that detect creature types, such as a paladin's Divine Sense or the trigger of a symbol spell. You choose a creature type and other spells and magical effects treat the target as if it were a creature of that type or of that alignment.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Augury",
    "school": "Divination",
    "classes":["Cleric", "Ritual Caster"],
    "casting time": "1 minute",
    "ritual": "yes",
    "range": "Self",
    "target": "",
    "components": "V, S, M (Specially marked sticks, bones, or similar tokens worth at least 25gp.)",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "By casting gem-inlaid sticks, rolling dragon bones, laying out ornate cards, or employing some other divining tool, you receive an omen from an otherworldly entity about the results of a specific course of action that you plan to take within the next 30 minutes. The DM chooses from the following possible omens:    Weal, for good results    Woe, for bad results    Weal and woe, for both good and bad results    Nothing, for results that aren't especially good or bad The spell doesn't take into account any possible circumstances that might change the outcome, such as the casting of additional spells or the loss or gain of a companion. If you cast the spell two or more times before completing your next long rest, there is a cumulative 25 percent chance for each casting after the first that you get a random reading. The DM makes this roll in secret.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Barkskin",
    "school": "Transmutation",
    "classes":["Cleric", "Druid", "Ranger"],
    "casting time": "1 action",
    "ritual": "",
    "range": "Touch",
    "target": "one willing creature",
    "components": "V, S, M (A handful of oak bark.)",
    "duration": "Up to one hour",
    "saving throw": "",
    "concentration": "yes",
    "description": "You touch a willing creature. Until the spell ends, the target's skin has a rough, bark-like appearance, and the target's AC can't be less than 16, regardless of what kind of armor it is wearing.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Blindness/Deafness",
    "school": "Necromancy",
    "classes":["Bard", "Cleric", "Sorcerer", "Warlock", "Wizard"],
    "casting time": "1 action ",
    "ritual": "",
    "range": "30 feet",
    "target": "",
    "components": "V",
    "duration": "1 minute ",
    "saving throw": "",
    "concentration": "",
    "description": "You can blind or deafen a foe. Choose one creature that you can see within range to make a constitution saving throw. If it fails, the target is either blinded or deafened (your choice) for the duration. At the end of each of its turns, the target can make a constitution saving throw. On a success, the spell ends.",
    "upgrade": "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.",
    "level": 2
  },
  {
    "name": "Blur",
    "school": "Illusion",
    "classes":["Druid", "Sorcerer", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "Self",
    "target": "",
    "components": "",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "Your body becomes blurred, shifting and wavering to all who can see you. For the duration, any creature has disadvantage on attack rolls against you. An attacker is immune to this effect if it doesn't rely on sight, as with blindsight, or can see through illusions, as with truesight.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Branding Smite",
    "school": "Evocation",
    "classes":["Paladin"],
    "casting time": "1 bonus action",
    "ritual": "",
    "range": "Self",
    "target": "",
    "components": "V",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "The next time you hit a creature with a weapon attack before this spell ends, the weapon gleams with astral radiance as you strike. The attack deals an extra 2d6 radiant damage to the target, which becomes visible if it's invisible, and the target sheds dim light in a 5 foot radius and can't become invisible until the spell ends.",
    "upgrade": "When you cast this spell using a spell slot of 3rd level or higher, the extra damage increases by 1d6 for each slot level above 2nd.",
    "level": 2
  },
  {
    "name": "Calm Emotions",
    "school": "Enchantment",
    "classes":["Bard", "Cleric", "Warlock"],
    "casting time": "1 action",
    "ritual": "",
    "range": "60 feet",
    "target": "",
    "components": "V, S ",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "You attempt to suppress strong emotions in a group of people. Each humanoid in a 20-foot-radius sphere centered on a point you choose within range must make a charisma saving throw; a creature can choose to fail this saving throw if it wishes. If a creature fails its saving throw, choose one of the following two effects. You can suppress any effect causing a target to be charmed or frightened. When this spell ends, any suppressed effect resumes, provided that its duration has not expired in the meantime. Alternatively, you can make a target indifferent about creatures of your choice that it is hostile toward. This indifference ends if the target is attacked or harmed by a spell or if it witnesses any of its friends being harmed. When the spell ends, the creature becomes hostile again, unless the DM rules otherwise.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Continual Flame",
    "school": "Evocation",
    "classes":["Cleric", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "Touch",
    "target": "",
    "components": "V, S, M (Ruby dust worth 50 gp, which the spell consumes.)",
    "duration": "Until dispelled",
    "saving throw": "",
    "concentration": "",
    "description": "A flame, equivalent in brightness to a torch, springs forth from an object that you touch. The effect looks like a regular flame, but it creates no heat and doesn't use oxygen. A continual flame can be covered or hidden but not smothered or quenched.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Darkness",
    "school": "Evocation",
    "classes":["Druid", "Sorcerer", "Warlock", "Wizard"],
    "casting time": "1 action ",
    "ritual": "",
    "range": "60 feet",
    "target": "",
    "components": "V, M (Bat fur and a drop of pitch or piece of coal.)",
    "duration": "Up to 10 minutes",
    "saving throw": "",
    "concentration": "yes",
    "description": "Magical darkness spreads from a point you choose within range to fill a 15-foot-radius sphere for the duration. The darkness spreads around corners. A creature with darkvision can't see through this darkness, and non-magical light can't illuminate it. If the point you choose is on an object you are holding or one that isn't being worn or carried, the darkness emanates from the object and moves with it. Completely covering the source of the darkness with an opaque object, such as a bowl or a helm, blocks the darkness. If any of this spell's area overlaps with an area of light created by a spell of 2nd level or lower, the spell that created the light is dispelled.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Darkvision",
    "school": "Transmutation",
    "classes":["Druid", "Ranger", "Sorcerer", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "Touch",
    "target": "",
    "components": "V, S, M (Either a pinch of dried carrot or an agate.)",
    "duration": "8 hours",
    "saving throw": "",
    "concentration": "",
    "description": "You touch a willing creature to grant it the ability to see in the dark. For the duration, that creature has darkvision out to a range of 60 feet.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Detect Thoughts",
    "school": "Divination",
    "classes":["Bard", "Sorcerer", "Warlock", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "Self",
    "target": "",
    "components": "V, S, M (A copper coin.)",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "For the duration, you can read the thoughts of certain creatures. When you cast the spell and as your action on each turn until the spell ends, you can focus your mind on any one creature that you can see within 30 feet of you. If the creature you choose has an Intelligence of 3 or lower or doesn’t speak any language, the creature is unaffected. You initially learn the surface thoughts of the creature—what is most on its mind in that moment. As an action, you can either shift your attention to another creature’s thoughts or attempt to probe deeper into the same creature’s mind. If you probe deeper, the target must make a Wisdom saving throw. If it fails, you gain insight into its reasoning (if any), its emotional state, and something that looms large in its mind (such as something it worries over, loves, or hates). If it succeeds, the spell ends. Either way, the target knows that you are probing into its mind, and unless you shift your attention to another creature’s thoughts, the creature can use its action on its turn to make an Intelligence check contested by your Intelligence check; if it succeeds, the spell ends. Questions verbally directed at the target creature naturally shape the course of its thoughts, so this spell is particularly effective as part of an interrogation. You can also use this spell to detect the presence of thinking creatures you can’t see. When you cast the spell or as your action during the duration, you can search for thoughts within 30 feet of you. The spell can penetrate barriers, but 2 feet of rock, 2 inches of any metal other than lead, or a thin sheet of lead blocks you. You can’t detect a creature with an Intelligence of 3 or lower or one that doesn’t speak any language. Once you detect the presence of a creature in this way, you can read its thoughts for the rest of the duration as described above, even if you can’t see it, but it must still be within range.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Enhance Ability",
    "school": "Transmutation",
    "classes":["Bard", "Cleric", "Druid", "Sorcerer"],
    "casting time": "1 action",
    "ritual": "",
    "range": "Touch",
    "target": "",
    "components": "V, S, M (Fur or a feather from a beast.)",
    "duration": "Up to 1 hour",
    "saving throw": "",
    "concentration": "yes",
    "description": "You touch a creature and bestow upon it a magical enhancement. Choose one of the following effects; the target gains that effect until the spell ends.Bear's Endurance. The target has advantage on constitution checks. It also gains 2d6 temporary hit points, which are lost when the spell ends.Bull's Strength. The target has advantage on strength checks, and his or her carrying capacity doubles.Cat's Grace. The target has advantage on dexterity checks. It also doesn't take damage from falling 20 feet or less if it isn't incapacitated.Eagle's Splendor. The target has advantage on Charisma checksFox's Cunning. The target has advantage on intelligence checks.Owl's Wisdom. The target has advantage on wisdom checks.",
    "upgrade": "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.",
    "level": 2
  },
  {
    "name": "Enlarge/Reduce",
    "school": "Transmutation",
    "classes": ["Sorcerer", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "30 feet",
    "target": "",
    "components": "V, S, M (A pinch iron powder.)",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "You cause a creature or an object you can see within range to grow larger or smaller for the duration. Choose either a creature or an object that is neither worn nor carried. If the target is unwilling, it can make a Constitution saving throw. On a success, the spell has no effect. If the target is a creature, everything it is wearing and carrying changes size with it. Any item dropped by an affected creature returns to normal size at once.Enlarge. The target’s size doubles in all dimensions, and its weight is multiplied by eight. This growth increases its size by one category—from Medium to Large, for example. If there isn’t enough room for the target to double its size, the creature or object attains the maximum possible size in the space available. Until the spell ends, the target also has advantage on Strength checks and Strength saving throws. The target’s weapons also grow to match its new size. While these weapons are enlarged, the target’s attacks with them deal 1d4 extra damage.Reduce. The target’s size is halved in all dimensions, and its weight is reduced to one-eighth of normal. This reduction decreases its size by one category—from Medium to Small, for example. Until the spell ends, the target also has disadvantage on Strength checks and Strength saving throws. The target’s weapons also shrink to match its new size. While these weapons are reduced, the target’s attacks with them deal 1d4 less damage (this can’t reduce the damage below 1).",
    "upgrade": "",
    "level": 0
  },
  {
    "name": "Enthrall",
    "school": "Enchantment",
    "classes": ["Bard", "Warlock"],
    "casting time": "1 action",
    "ritual": "",
    "range": "60 feet",
    "target": "",
    "components": "V, S",
    "duration": "1 minute",
    "saving throw": "",
    "concentration": "",
    "description": "You weave a distracting string of words, causing creatures of your choice that you can see within range and that can hear you to make a wisdom saving throw. Any creature that can't be charmed succeeds on this saving throw automatically, and if you or your companions are fighting a creature, it has advantage on the save. On a failed save, the target has disadvantage on Wisdom (Perception) checks made to perceive any creature other than you until the spell ends or until the target can no longer hear you. The spell ends if you are incapacitated or can no longer speak.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Find Steed",
    "school": "Conjuration",
    "classes": ["Conjuration"],
    "casting time": "10 minutes",
    "ritual": "",
    "range": "30 feet",
    "target": "",
    "components": "V, S",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "You summon a spirit that assumes the form of an unusually intelligent, strong, and loyal steed, creating a long-lasting bond with it. Appearing in an unoccupied space within range, the steed takes on a form that you choose, such as a warhorse, a pony, a camel, an elk, or a mastiff. (Your DM might allow other animals to be summoned as steeds.) The steed has the statistics of the chosen form, though it is a celestial, fey, or fiend (your choice) instead of its normal type. Additionally, if your steed has an Intelligence of 5 or less, its Intelligence becomes 6, and it gains the ability to understand one language of your choice that you speak. Your steed serves you as a mount, both in combat and out, and you have an instinctive bond with it that allows you to fight as a seamless unit. While mounted on your steed, you can make any spell you cast that targets only you also target your steed. When the steed drops to 0 hit points, it disappears, leaving behind no physical form. You can also dismiss your steed at any time as an action, causing it to disappear. In either case, casting this spell again summons the same steed, restored to its hit point maximum. While your steed is within 1 mile of you, you can communicate with it telepathically. You can't have more than one steed bonded by this spell at a time. As an action, you can release the steed from its bond at any time, causing it to disappear.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Find Traps",
    "school": "Divination",
    "classes": ["Cleric", "Druid", "Ranger"],
    "casting time": "1 action",
    "ritual": "",
    "range": "120 feet",
    "target": "",
    "components": "V, S",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "You sense the presence of any trap within range that is within line of sight. A trap, for the purpose of this spell, includes anything that would inflict a sudden or unexpected effect you consider harmful or undesirable, which was specifically intended as such by its creator. Thus, the spell would sense an area affected by the alarm spell, a glyph of warding, or a mechanical pit trap, but it would not reveal a natural weakness in the floor, an unstable ceiling, or a hidden sinkhole. This spell merely reveals that a trap is present. You don't learn the location of each trap, but you do learn the general nature of the danger posed by a trap you sense.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Flame Blade",
    "school": "Evocation",
    "classes": ["Druid"],
    "casting time": "1 bonus action",
    "ritual": "",
    "range": "Self",
    "target": "",
    "components": "V, S, M (Leaf of sumac.)",
    "duration": "Up to 10 minutes",
    "saving throw": "",
    "concentration": "yes",
    "description": "You evoke a fiery blade in your free hand. The blade is similar in size and shape to a scimitar, and it lasts for the duration. If you let go of the blade, it disappears, but you can evoke the blade again as a bonus action. You can use your action to make a melee spell attack with the fiery blade. On a hit, the target takes 3d6 fire damage. The flaming blade sheds bright light in a 10-foot radius and dim light for an additional 10 feet.",
    "upgrade": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for every two slot levels above 2nd.",
    "level": 2
  },
  {
    "name": "Flaming Sphere",
    "school": "Conjuration",
    "classes": ["Cleric", "Druid", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "60 feet",
    "target": "",
    "components": "V, S, M (A bit of tallow, a pinch of brimstone, and a dusting of powdered iron.)",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "A 5-foot-diameter sphere of fire appears in an unoccupied space of your choice within range and lasts for the duration. Any creature that ends its turn within 5 feet of the sphere must make a dexterity saving throw. The creature takes 2d6 fire damage on a failed save, or half as much damage on a successful one. As a bonus action, you can move the sphere up to 30 feet. If you ram the sphere into a creature, that creature must make the saving throw against the sphere's damage, and the sphere stops moving this turn. When you move the sphere, you can direct it over barriers up to 5 feet tall and jump it across pits up to 10 feet wide. The sphere ignites flammable objects not being worn or carried, and it sheds bright light in a 20-foot radius and dim light for an additional 20 feet.",
    "upgrade": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d6 for each slot level above 2nd.",
    "level": 2
  },
  {
    "name": "Gentle Repose",
    "school": "Necromancy",
    "classes": ["Cleric", "Ritual Caster", "Wizard"],
    "casting time": "1 action",
    "ritual": "yes",
    "range": "Touch",
    "target": "",
    "components": "V, S, M (A pinch of salt and one copper piece placed on each of the corpse's eyes, which must remain there for the duration.)",
    "duration": "10 days",
    "saving throw": "",
    "concentration": "",
    "description": "You touch a corpse or other remains. For the duration, the target is protected from decay and can't become undead. The spell also effectively extends the time limit on raising the target from the dead, since days spent under the influence of this spell don't count against the time limit of spells such as raise dead.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Gust of Wind",
    "school": "Evocation",
    "classes": ["Cleric", "Druid", "Sorcerer", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "Self",
    "target": "",
    "components": "V, S, M (A legume seed.)",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "",
    "description": "A line of strong wind 60 feet long and 10 feet wide blasts from you in a direction you choose for the spell's duration. Each creature that starts its turn in the line must succeed on a strength saving throw or be pushed 15 feet away from you in a direction following the line. Any creature in the line must spend 2 feet of movement for every 1 foot it moves when moving closer to you. The gust disperses gas or vapor, and it extinguishes candles, torches, and similar unprotected flames in the area. It causes protected flames, such as those of lanterns, to dance wildly and has a 50 percent chance to extinguish them. As a bonus action on each of your turns before the spell ends, you can change the direction in which the line blasts from you.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Heat Metal",
    "school": "Transmutation",
    "classes": ["Bard", "Druid"],
    "casting time": "1 action",
    "ritual": "",
    "range": "60 feet",
    "target": "",
    "components": "V, S, M (A piece of iron and a flame.)",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "Choose a manufactured metal object, such as a metal weapon or a suit of heavy or medium metal armor, that you can see within range. You cause the object to glow red-hot. Any creature in physical contact with the object takes 2d8 fire damage when you cast the spell. Until the spell ends, you can use a bonus action on each of your subsequent turns to cause this damage again. If a creature is holding or wearing the object and takes the damage from it, the creature must succeed on a constitution saving throw or drop the object if it can. If it doesn't drop the object, it has disadvantage on attack rolls and ability checks until the start of your next turn.",
    "upgrade": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.",
    "level": 2
  },
  {
    "name": "Hold Person",
    "school": "Enchantment",
    "classes": ["Bard", "Cleric", "Druid", "Paladin", "Sorcerer", "Warlock", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "60 feet",
    "target": "",
    "components": "V, S, M (A small, straight piece of iron.)",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "Choose a humanoid that you can see within range. The target must succeed on a wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another wisdom saving throw. On a success, the spell ends on the target.",
    "upgrade": "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional humanoid for each slot level above 2nd. The humanoids must be within 30 feet of each other when you target them.",
    "level": 2
  },
  {
    "name": "Invisibility",
    "school": "Illusion",
    "classes": ["Bard", "Druid", "Sorcerer", "Warlock", "Wizard"],
    "casting time": "",
    "ritual": "",
    "range": "Touch",
    "target": "",
    "components": "V, S, M (An eyelash encased in gum arabic.)",
    "duration": "Up to 1 hour",
    "saving throw": "",
    "concentration": "yes",
    "description": "A creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target's person. The spell ends for a target that attacks or casts a spell.",
    "upgrade": "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.",
    "level": 2
  },
  {
    "name": "Knock",
    "school": "Transmutation",
    "classes": ["Bard", "Sorcerer", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "60 feet",
    "target": "",
    "components": "V",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "Choose an object that you can see within range. The object can be a door, a box, a chest, a set of manacles, a padlock, or another object that contains a mundane or magical means that prevents access. A target that is held shut by a mundane lock or that is stuck or barred becomes unlocked, unstuck, or unbarred. If the object has multiple locks, only one of them is unlocked. If you choose a target that is held shut with arcane lock, that spell is suppressed for 10 minutes, during which time the target can be opened and shut normally. When you cast the spell, a loud knock, audible from as far away as 300 feet, emanates from the target object.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Lesser Restoration",
    "school": "Abjuration",
    "classes": ["Bard", "Cleric", "Druid", "Paladin", "Ranger"],
    "casting time": "1 action",
    "ritual": "",
    "range": "Touch",
    "target": "",
    "components": "V, S",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "You touch a creature and can end either one disease or one condition afflicting it. The condition can be blinded, deafened, paralyzed, or poisoned.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Levitate",
    "school": "Transmutation",
    "classes": ["Sorcerer", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "60 feet",
    "target": "",
    "components": "V, S, M (Either a small leather loop or a piece of golden wire bent into a cup shape with a long shank on one end.)",
    "duration": "Up to 10 minutes",
    "saving throw": "",
    "concentration": "yes",
    "description": "One creature or object of your choice that you can see within range rises vertically, up to 20 feet, and remains suspended there for the duration. The spell can levitate a target that weighs up to 500 pounds. An unwilling creature that succeeds on a constitution saving throw is unaffected. The target can move only by pushing or pulling against a fixed object or surface within reach (such as a wall or a ceiling), which allows it to move as if it were climbing. You can change the target's altitude by up to 20 feet in either direction on your turn. If you are the target, you can move up or down as part of your move. Otherwise, you can use your action to move the target, which must remain within the spell's range. When the spell ends, the target floats gently to the ground if it is still aloft.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Locate Animals or Plants",
    "school": "Divination",
    "classes": ["Bard", "Druid", "Ranger", "Ritual Caster"],
    "casting time": "1 action",
    "ritual": "yes",
    "range": "Self",
    "target": "",
    "components": "V, S, M (A bit of fur from a bloodhound.)",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "Describe or name a specific kind of beast or plant. Concentrating on the voice of nature in your surroundings, you learn the direction and distance to the closest creature or plant of that kind within 5 miles, if any are present.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Locate Object",
    "school": "Divination",
    "classes": ["Bard", "Cleric", "Druid", "Paladin", "Ranger", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "self",
    "target": "",
    "components": "V, S, M (A forked twig.)",
    "duration": "Up to 10 minutes",
    "saving throw": "",
    "concentration": "yes",
    "description": "Describe or name an object that is familiar to you. You sense the direction to the object's location, as long as that object is within 1,000 feet of you. If the object is in motion, you know the direction of its movement. The spell can locate a specific object known to you, as long as you have seen it up close—within 30 feet—at least once. Alternatively, the spell can locate the nearest object of a particular kind, such as a certain kind of apparel, jewelry, furniture, tool, or weapon. This spell can't locate an object if any thickness of lead, even a thin sheet, blocks a direct path between you and the object.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Magic Mouth",
    "school": "Illusion",
    "classes": ["Bard", "Ritual Caster", "Wizard"],
    "casting time": "1 minute",
    "ritual": "yes",
    "range": "30 feet",
    "target": "",
    "components": "V, S, M (A small bit of honeycomb and jade dust worth at least 10 gp, which the spell consumes)",
    "duration": "",
    "saving throw": "",
    "concentration": "",
    "description": "You implant a message within an object in range, a message that is uttered when a trigger condition is met. Choose an object that you can see and that isn’t being worn or carried by another creature. Then speak the message, which must be 25 words or less, though it can be delivered over as long as 10 minutes. Finally, determine the circumstance that will trigger the spell to deliver your message. When that circumstance occurs, a magical mouth appears on the object and recites the message in your voice and at the same volume you spoke. If the object you chose has a mouth or something that looks like a mouth (for example, the mouth of a statue), the magical mouth appears there so that the words appear to come from the object’s mouth. When you cast this spell, you can have the spell end after it delivers its message, or it can remain and repeat its message whenever the trigger occurs. The triggering circumstance can be as general or as detailed as you like, though it must be based on visual or audible conditions that occur within 30 feet of the object. For example, you could instruct the mouth to speak when any creature moves within 30 feet of the object or when a silver bell rings within 30 feet of it.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Magic Weapon",
    "school": "Transmutation",
    "classes": ["Cleric", "Paladin", "Wizard"],
    "casting time": "1 bonus action",
    "ritual": "",
    "range": "Touch",
    "target": "",
    "components": "V,S",
    "duration": "Up to 1 hour",
    "saving throw": "",
    "concentration": "yes",
    "description": "You touch a non-magical weapon. Until the spell ends, that weapon becomes a magic weapon with a +1 bonus to attack rolls and damage rolls.",
    "upgrade": "When you cast this spell using a spell slot of 4th level or higher, the bonus increases to +2. When you use a spell slot of 6th level or higher, the bonus increases to +3.",
    "level": 2
  },
  {
    "name": "Mirror Image",
    "school": "Illusion",
    "classes": ["Cleric", "Druid", "Sorcerer", "Warlock", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "",
    "target": "Self",
    "components": "",
    "duration": "1 minute",
    "saving throw": "",
    "concentration": "",
    "description": "Three illusionary duplicates of yourself appear in your space. Until the end of the spell, duplicates move with you and imitate your actions, swapping their position so that it is impossible to determine which image is real. You can use your action to dispel the illusory duplicates. Whenever a creature is targeting you with an attack during the duration of the spell, roll 1d20 to determine if the attack does not target rather one of your duplicates. If you have three duplicates, you need 6 or more on your throw to lead the target of the attack to a duplicate. With two duplicates, you need 8 or more. With one duplicate, you need 11 or more. The CA of a duplicate is 10 + your Dexterity modifier. If an attack hits a duplicate, it is destroyed. A duplicate may be destroyed not just an attack on key. It ignores other damage and effects. The spell ends if the three duplicates are destroyed. A creature is unaffected by this fate if she can not see if it relies on a different meaning as vision, such as blind vision, or if it can perceive illusions as false, as with clear vision.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Misty Step",
    "school": "Conjuration",
    "classes": ["Druid", "Paladin", "Sorcerer", "Warlock", "Wizard"],
    "casting time": "1 bonus action",
    "ritual": "",
    "range": "Self",
    "target": "",
    "components": "V",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "Briefly surrounded by silvery mist, you teleport up to 30 feet to an unoccupied space that you can see.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Moonbeam",
    "school": "Evocation",
    "classes": ["Druid", "Paladin"],
    "casting time": "1 action",
    "ritual": "",
    "range": "120 feet",
    "target": "",
    "components": "V, S, M (Several seeds of any moonseed plant and a piece of opalescent feldspar.)",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "A silvery beam of pale light shines down in a 5-foot radius, 40-foot-high cylinder centered on a point within range. Until the spell ends, dim light fills the cylinder. When a creature enters the spell's area for the first time on a turn or starts its turn there, it is engulfed in ghostly flames that cause searing pain, and it must make a constitution saving throw. It takes 2d10 radiant damage on a failed save, or half as much damage on a successful one. A shapechanger makes its saving throw with disadvantage. If it fails, it also instantly reverts to its original form and can't assume a different form until it leaves the spell's light. On each of your turns after you cast this spell, you can use an action to move the beam 60 feet in any direction.",
    "upgrade": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d1O for each slot level above 2nd.",
    "level": 2
  },
  {
    "name": "Pass without Trace",
    "school": "Abjuration",
    "classes": ["Cleric", "Druid", "Ranger"],
    "casting time": "1 action",
    "ritual": "",
    "range": "Self",
    "target": "",
    "components": "V, S, M (Ashes from a burned leaf of mistletoe and a sprig of spruce.)",
    "duration": "Up to 1 hour",
    "saving throw": "",
    "concentration": "yes",
    "description": "A veil of shadows and silence radiates from you, masking you and your companions from detection. For the duration, each creature you choose within 30 feet of you (including you) has a +10 bonus to Dexterity (Stealth) checks and can't be tracked except by magical means. A creature that receives this bonus leaves behind no tracks or other traces of its passage.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Prayer of Healing",
    "school": "Evocation",
    "classes": ["Cleric"],
    "casting time": "10 minutes",
    "ritual": "",
    "range": "30 feet",
    "target": "",
    "components": "V",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "Up to six creatures of your choice that you can see within range each regain hit points equal to 2d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs.",
    "upgrade": "When you cast this spell using a spell slot of 3rd level or higher, the healing increases by 1d8 for each slot level above 2nd.",
    "level": 2
  },
  {
    "name": "Protection from Poison",
    "school": "Abjuration",
    "classes": ["Cleric", "Druid", "Paladin", "Ranger"],
    "casting time": "1 action",
    "ritual": "",
    "range": "Touch",
    "target": "",
    "components": "V,S",
    "duration": "1 hour",
    "saving throw": "",
    "concentration": "",
    "description": "You touch a creature. If it is poisoned, you neutralize the poison. If more than one poison afflicts the target, you neutralize one poison that you know is present, or you neutralize one at random. For the duration, the target has advantage on saving throws against being poisoned, and it has resistance to poison damage.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Ray of Enfeeblement",
    "school": "Necromancy",
    "classes": ["Warlock", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "60 feet",
    "target": "",
    "components": "V,S",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "A black beam of enervating energy springs from your finger toward a creature within range. Make a ranged spell attack against the target. On a hit, the target deals only half damage with weapon attacks that use Strength until the spell ends. At the end of each of the target's turns, it can make a constitution saving throw against the spell. On a success, the spell ends.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Rope Trick",
    "school": "Transmutation",
    "classes": ["Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "Touch",
    "target": "",
    "components": "V, S, M (Powdered corn extract and a twisted loop of parchment.)",
    "duration": "1 hour",
    "saving throw": "",
    "concentration": "",
    "description": "You touch a length of rope that is up to 60 feet long. One end of the rope then rises into the air until the whole rope hangs perpendicular to the ground. At the upper end of the rope, an invisible entrance opens to an extra-dimensional space that lasts until the spell ends. The extra-dimensional space can be reached by climbing to the top of the rope. The space can hold as many as eight Medium or smaller creatures. The rope can be pulled into the space, making the rope disappear from view outside the space. Attacks and spells can't cross through the entrance into or out of the extra-dimensional space, but those inside can see out of it as if through a 3-foot-by-5-foot window centered on the rope. Anything inside the extra-dimensional space drops out when the spell ends.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Scorching Ray",
    "school": "Evocation",
    "classes": ["Cleric", "Sorcerer", "Warlock", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "120 feet",
    "target": "",
    "components": "V,S",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "You generate three rays of fire and will throw to targets in the range of the spell. You can project them on one or more targets. Perform a remote attack spell for each department. If it hits, the target takes 2d6 fire damage.",
    "upgrade": "When you cast this spell using a 3 or higher level spell slot, you generate an additional radius for each level of higher spell slot 2.",
    "level": 2
  },
  {
    "name": "See Invisibility",
    "school": "Divination",
    "classes": ["Bard", "Sorcerer", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "Self",
    "target": "",
    "components": "V, S, M (A dash of talc and a small amount of silver powder.)",
    "duration": "1 hour",
    "saving throw": "",
    "concentration": "",
    "description": "For the duration of the spell, you see invisible creatures and objects as if they were visible, and you can see through Ethereal. The ethereal objects and creatures appear ghostly translucent.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Shatter",
    "school": "Evocation",
    "classes": ["Bard", "Cleric", "Sorcerer", "Warlock", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "60 feet",
    "target": "",
    "components": "V, S, M (A burst of mica.)",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "",
    "description": "A sudden loud ringing noise, painfully intense, erupts from a point of your choice within range. Each creature in a 10-­‐‑foot-­‐‑radius sphere centered on that point must make a Constitution saving throw. A creature takes 3d8 thunder damage on a failed save, or half as much damage on a successful one. A creature made of inorganic material such as stone,crystal, or metal has disadvantage on this saving throw. A nonmagical object that isn’t being worn or carried also takes the damage if it’s in the spell’s area.",
    "upgrade": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.",
    "level": 2
  },
  {
    "name": "Silence",
    "school": "Illusion",
    "classes": ["Bard", "Cleric", "Druid", "Ranger", "Ritual Caster"],
    "casting time": "1 action",
    "ritual": "yes",
    "range": "120 feet",
    "target": "",
    "components": "V,S",
    "duration": "Up to 10 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "For the duration, no sound can be created within or pass through a 20-foot-radius sphere centered on a point you choose within range. Any creature or object entirely inside the sphere is immune to thunder damage, and creatures are deafened while entirely inside it. Casting a spell that includes a verbal component is impossible there.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Spider Climb",
    "school": "Transmutation",
    "classes": ["Druid", "Sorcerer", "Warlock", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "Touch",
    "target": "",
    "components": "V, S, M (A drop of bitumen and a spider.)",
    "duration": "Up to 1 hour",
    "saving throw": "",
    "concentration": "yes",
    "description": "Until the spell ends, one willing creature you touch gains the ability to move up, down, and across vertical surfaces and upside down along ceilings, while leaving its hands free. The target also gains a climbing speed equal to its walking speed.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Spike Growth",
    "school": "Transmutation",
    "classes": ["Cleric", "Druid", "Ranger"],
    "casting time": "1 action",
    "ritual": "",
    "range": "150 feet",
    "target": "",
    "components": "V, S, M (Seven sharp spines or seven twigs cut peak.)",
    "duration": "Up to 10 minutes",
    "saving throw": "",
    "concentration": "yes",
    "description": "The ground in a 20-foot radius centered on a point within range twists and sprouts hard spikes and thorns. The area becomes difficult terrain for the duration. When a creature moves into or within the area, it takes 2d4 piercing damage for every 5 feet it travels. The development of land is camouflaged to look natural. Any creature that does not see the area when the spell is spell casts must make a Wisdom (Perception) opposite the DD backup your fate or it does not recognize the dangerous nature of the ground before entering.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Spiritual Weapon",
    "school": "Evocation",
    "classes": ["Cleric"],
    "casting time": "1 bonus action",
    "ritual": "",
    "range": "60 feet",
    "target": "",
    "components": "V,S",
    "duration": "1 minute",
    "saving throw": "",
    "concentration": "",
    "description": "You create a floating, spectral weapon within range that lasts for the duration or until you cast this spell again. When you cast the spell, you can make a melee spell attack against a creature within 5 feet of the weapon. On a hit, the target takes force damage equal to 1d8 + your spellcasting ability modifier. As a bonus action on your turn, you can move the weapon up to 20 feet and repeat the attack against a creature within 5 feet of it. The weapon can take whatever form you choose. Clerics of deities who are associated with a particular weapon (as St. Cuthbert is known for his mace and Thor for his hammer) make this spell's effect resemble that weapon.",
    "upgrade": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for every two slot levels above the 2nd.",
    "level": 2
  },
  {
    "name": "Suggestion",
    "school": "Enchantment",
    "classes": ["Bard", "Cleric", "Sorcerer", "Warlock", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "30 feet",
    "target": "",
    "components": "V, M (A snake's tongue and either a bit of honeycomb or a drop of sweet oil.)",
    "duration": "Up to 8 hours",
    "saving throw": "",
    "concentration": "yes",
    "description": "You suggest a course of activity (limited to a sentence or two) and magically influence a creature you can see within range that can hear and understand you. Creatures that can't be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act ends the spell. The target must make a wisdom saving throw. On a failed save, it pursues the course of action you described to the best of its ability. The suggested course of action can continue for the entire duration. If the suggested activity can be completed in a shorter time, the spell ends when the subject finishes what it was asked to do. You can also specify conditions that will trigger a special activity during the duration. For example, you might suggest that a knight give her warhorse to the first beggar she meets. If the condition isn't met before the spell expires, the activity isn't performed. If you or any of your companions damage the target, the spell ends.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Warding Bond",
    "school": "Abjuration",
    "classes": ["Cleric"],
    "casting time": "",
    "ritual": "",
    "range": "Touch",
    "target": "",
    "components": "V, S, M (A pair of platinum rings worth at least 50gp each, which you and the target must wear for the duration.)",
    "duration": "1 hour",
    "saving throw": "",
    "concentration": "",
    "description": "This spell wards a willing creature you touch and creates a mystic connection between you and the target until the spell ends. While the target is within 60 feet of you, it gains a +1 bonus to AC and saving throws, and it has resistance to all damage. Also, each time it takes damage, you take the same amount of damage. The spell ends if you drop to 0 hit points or if you and the target become separated by more than 60 feet. It also ends if the spell is cast again on either of the connected creatures. You can also dismiss the spell as an action.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Web",
    "school": "Conjuration",
    "classes": ["Druid", "Sorcerer", "Wizard"],
    "casting time": "1 action",
    "ritual": "",
    "range": "60 feet",
    "target": "",
    "components": "V, S, M (A bit of spiderweb.)",
    "duration": "Up to 1 hour",
    "saving throw": "",
    "concentration": "yes",
    "description": "You conjure a mass of thick, sticky webbing at a point of your choice within range. The webs fill a 20-foot cube from that point for the duration. The webs are difficult terrain and lightly obscure their area. If the webs aren't anchored between two solid masses (such as walls or trees) or layered across a floor, wall, or ceiling, the conjured web collapses on itself, and the spell ends at the start of your next turn. Webs layered over a flat surface have a depth of 5 feet. Each creature that starts its turn in the webs or that enters them during its turn must make a dexterity saving throw. On a failed save, the creature is restrained as long as it remains in the webs or until it breaks free. A creature restrained by the webs can use its action to make a Strength check against your spell save DC. If it succeeds, it is no longer restrained. The webs are flammable. Any 5-foot cube of webs exposed to fire burns away in 1 round, dealing 2d4 fire damage to any creature that starts its turn in the fire.",
    "upgrade": "",
    "level": 2
  },
  {
    "name": "Zone of Truth",
    "school": "Enchantment",
    "classes": ["Bard", "Cleric", "Paladin"],
    "casting time": "1 action",
    "ritual": "",
    "range": "60 feet",
    "target": "",
    "components": "V,S",
    "duration": "10 minutes",
    "saving throw": "",
    "concentration": "",
    "description": "You create a magical zone that guards against deception in a 15-foot-radius sphere centered on a point of your choice within range. Until the spell ends, a creature that enters the spell's area for the first time on a turn or starts its turn there must make a Charisma saving throw. On a failed save, a creature can't speak a deliberate lie while in the radius. You know whether each creature succeeds or fails on its saving throw. An affected creature is aware of the fate and can avoid answering questions she would normally have responded with a lie. Such a creature can remain evasive in his answers as they remain within the limits of truth.",
    "upgrade": "",
    "level": 2
  }
]