[
  {
    "name": "Arcane Eye",
    "school": "Divination",
    "classes": [
      "Cleric",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "30 feet",
    "target": "",
    "components": "V, S, M (A bit of bat fur.)",
    "duration": "Up to 1 hour",
    "saving throw": "",
    "concentration": "yes",
    "description": "You create an invisible, magical eye within range that hovers in the air for the duration. You mentally receive visual information from the eye, which has normal vision and darkvision out to 30 feet. The eye can look in every direction. As an action, you can move the eye up to 30 feet in any direction. There is no limit to how far away from you the eye can move, but it can't enter another plane of existence. A solid barrier blocks the eye's movement, but the eye can pass through an opening as small as 1 inch in diameter.",
    "upgrade": "",
    "level": 4
  },
  {
    "name": "Banishment",
    "school": "Abjuration",
    "classes": [
      "Cleric",
      "Paladin",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "60 feet",
    "target": "",
    "components": "V, S, M (An item distasteful to the target.)",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "You attempt to send one creature that you can see within range to another plane of existence. The target must succeed on a charisma saving throw or be banished. If the target is native to the plane of existence you're on, you banish the target to a harmless demiplane. While there, the target is incapacitated. The target remains there until the spell ends, at which point the target reappears in the space it left or in the nearest unoccupied space if that space is occupied. If the target is native to a different plane of existence than the one you're on, the target is banished with a faint popping noise, returning to its home plane. If the spell ends before 1 minute has passed, the target reappears in the space it left or in the nearest unoccupied space if that space is occupied. Otherwise, the target doesn't return.",
    "upgrade": "When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th.",
    "level": 4
  },
  {
    "name": "Black Tentacles",
    "school": "Conjuration",
    "classes": [
      "Warlock",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "90 feet",
    "target": "",
    "components": "V, S, M (A piece of tentacle from a giant octopus or a giant squid)",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "Squirming, ebony tentacles fill a 20-foot square on ground that you can see within range. For the duration, these tentacles turn the ground in the area into difficult terrain. When a creature enters the affected area for the first time on a turn or starts its turn there, the creature must succeed on a Dexterity saving throw or take 3d6 bludgeoning damage and be restrained by the tentacles until the spell ends. A creature that starts its turn in the area and is already restrained by the tentacles takes 3d6 bludgeoning damage. A creature restrained by the tentacles can use its action to make a Strength or Dexterity check (its choice) against your spell save DC. On a success, it frees itself.",
    "upgrade": "",
    "level": 4
  },
  {
    "name": "Blight",
    "school": "Necromancy",
    "classes": [
      "Druid",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "30 feet",
    "target": "",
    "components": "V, S",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "no",
    "description": "Necromantic energy washes over a creature of your choice that you can see within range, draining moisture and vitality from it. The target must make a constitution saving throw. The target takes 8d8 necrotic damage on a failed save, or half as much damage on a successful one. The spell has no effect on undead or constructs. If you target a plant creature or a magical plant, it makes the saving throw with disadvantage, and the spell deals maximum damage to it. If you target a nonmagical plant that isn't a creature, such as a tree or shrub, it doesn't make a saving throw; it simply withers and dies.",
    "upgrade": "When you cast this spell using a spell slot of 5th level of higher, the damage increases by 1d8 for each slot level above 4th.",
    "level": 4
  },
  {
    "name": "Compulsion",
    "school": "Enchantment",
    "classes": [
      "Bard"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "30 feet",
    "target": "",
    "components": "V, S",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "Creatures of your choice that you can see within range and that can hear you must make a Wisdom saving throw. A target automatically succeeds on this saving throw if it can't be charmed. On a failed save, a target is affected by this spell. Until the spell ends, you can use a bonus action on each of your turns to designate a direction that is horizontal to you. Each affected target must use as much of its movement as possible to move in that direction on its next turn. It can take its action before it moves. After moving in this way, it can make another Wisdom saving throw to try to end the effect. A target isn't compelled to move into an obviously deadly hazard, such as a fire or pit, but it will provoke opportunity attacks to move in the designated direction.",
    "upgrade": "",
    "level": 4
  },
  {
    "name": "Confusion",
    "school": "Enchantment",
    "classes": [
      "Bard",
      "Cleric",
      "Druid",
      "Sorcerer",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "90 feet",
    "target": "",
    "components": "V, S, M (Three walnut shells.)",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "This spell assaults and twists creatures’ minds, spawning delusions and provoking uncontrolled action. Each creature in a 10-­‐‑foot-­‐‑radius sphere centered on a point you choose within range must succeed on a Wisdom saving throw when you cast this spell or be affected by it. An affected target can’t take reactions and must roll a d10 at the start of each of its turns to determine its behavior for that turn. At the end of each of its turns, an affected target can make a Wisdom saving throw. If it succeeds, this effect ends for that target.",
    "upgrade": "When you cast this spell using a spell slot of 5th level or higher, the radius of the sphere increases by 5 feet for each slot level above 4th.",
    "level": 4
  },
  {
    "name": "Conjure Minor Elementals",
    "school": "Conjuration",
    "classes": [
      "Druid",
      "Wizard"
    ],
    "casting time": "1 minute",
    "ritual": false,
    "range": "90 feet",
    "target": "",
    "components": "V, S",
    "duration": "Up to 1 hour",
    "saving throw": "",
    "concentration": "yes",
    "description": "You summon elementals that appear in unoccupied spaces that you can see within range. You choose one the following options for what appears: - One elemental of challenge rating 2 or lower - Two elementals of challenge rating 1 or lower - Four elementals of challenge rating 1/2 or lower - Eight elementals of challenge rating 1/4 or lower. An elemental summoned by this spell disappears when it drops to 0 hit points or when the spell ends. The summoned creatures are friendly to you and your companions. Roll initiative for the summoned creatures as a group, which has its own turns. They obey any verbal commands that you issue to them (no action required by you). If you don't issue any commands to them, they defend themselves from hostile creatures, but otherwise take no actions. The DM has the creatures' statistics.",
    "upgrade": "When you cast this spell using certain higher-level spell slots, you choose one of the summoning options above, and more creatures appear: twice as many with a 6th-level slot and three times as many with an 8th-level slot.",
    "level": 4
  },
  {
    "name": "Conjure Woodland Beings",
    "school": "Conjuration",
    "classes": [
      "Druid",
      "Ranger"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "60 feet",
    "target": "",
    "components": "V, S, M (One holly berry per creature summoned.)",
    "duration": "Up to 1 hour",
    "saving throw": "",
    "concentration": "yes",
    "description": "You summon fey creatures that appear in unoccupied spaces that you can see within range. Choose one of the following options for what appears: - One fey creature of challenge rating 2 or lower - Two fey creatures of challenge rating 1 or lower - Four fey creatures of challenge rating 1/2 or lower - Eight fey creatures of challenge rating 1/4 or lower A summoned creature disappears when it drops to 0 hit points or when the spell ends. The summoned creatures are friendly to you and your companions. Roll initiative for the summoned creatures as a group, which have their own turns. They obey any verbal commands that you issue to them (no action required by you). If you don't issue any commands to them, they defend themselves from hostile creatures, but otherwise take no actions. The DM has the creatures' statistics.",
    "upgrade": "When you cast this spell using certain higher-level spell slots, you choose one of the summoning options above, and more creatures appear: twice as many with a 6th-level slot and three times as many with an 8th-level slot.",
    "level": 4
  },
  {
    "name": "Control Water",
    "school": "Transmutation",
    "classes": [
      "Cleric",
      "Druid",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "300 feet",
    "target": "",
    "components": "V, S, M (A drop of water and a pinch of dust.)",
    "duration": "Up to 10 minutes",
    "saving throw": "",
    "concentration": "yes",
    "description": "Until the spell ends, you control any freestanding water inside an area you choose that is a cube up to 100 feet on a side. You can choose from any of the following effects when you cast this spell. As an action on your turn, you can repeat the same effect or choose a different one.**Flood.** You cause the water level of all standing water in the area to rise by as much as 20 feet. If the area includes a shore, the flooding water spills over onto dry land. instead create a 20-foot tall wave that travels from one side of the area to the other and then crashes down. Any Huge or smaller vehicles in the wave's path are carried with it to the other side. Any Huge or smaller vehicles struck by the wave have a 25 percent chance of capsizing. The water level remains elevated until the spell ends or you choose a different effect. If this effect produced a wave, the wave repeats on the start of your next turn while the flood effect lasts **Part Water.** You cause water in the area to move apart and create a trench. The trench extends across the spell's area, and the separated water forms a wall to either side. The trench remains until the spell ends or you choose a different effect. The water then slowly fills in the trench over the course of the next round until the normal water level is restored.**Redirect Flow.** You cause flowing water in the area to move in a direction you choose, even if the water has to flow over obstacles, up walls, or in other unlikely directions. The water in the area moves as you direct it, but once it moves beyond the spell's area, it resumes its flow based on the terrain conditions. The water continues to move in the direction you chose until the spell ends or you choose a different effect.**Whirlpool.** This effect requires a body of water at least 50 feet square and 25 feet deep. You cause a whirlpool to form in the center of the area. The whirlpool forms a vortex that is 5 feet wide at the base, up to 50 feet wide at the top, and 25 feet tall. Any creature or object in the water and within 25 feet of the vortex is pulled 10 feet toward it. A creature can swim away from the vortex by making a Strength (Athletics) check against your spell save DC. When a creature enters the vortex for the first time on a turn or starts its turn there, it must make a strength saving throw. On a failed save, the creature takes 2d8 bludgeoning damage and is caught in the vortex until the spell ends. On a successful save, the creature takes half damage, and isn't caught in the vortex. A creature caught in the vortex can use its action to try to swim away from the vortex as described above, but has disadvantage on the Strength (Athletics) check to do so. The first time each turn that an object enters the vortex, the object takes 2d8 bludgeoning damage; this damage occurs each round it remains in the vortex.",
    "upgrade": "",
    "level": 4
  },
  {
    "name": "Death Ward",
    "school": "Abjuration",
    "classes": [
      "Cleric",
      "Paladin"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "Touch",
    "target": "",
    "components": "V, S",
    "duration": "8 hours",
    "saving throw": "",
    "concentration": "no",
    "description": "You touch a creature and grant it a measure of protection from death. The first time the target would drop to 0 hit points as a result of taking damage, the target instead drops to 1 hit point, and the spell ends. If the spell is still in effect when the target is subjected to an effect that would kill it instantaneously without dealing damage, that effect is instead negated against the target, and the spell ends.",
    "upgrade": "",
    "level": 4
  },
  {
    "name": "Dimension Door",
    "school": "Conjuration",
    "classes": [
      "Bard",
      "Cleric",
      "Paladin",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "500 feet",
    "target": "",
    "components": "V",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "no",
    "description": "You teleport yourself from your current location to any other spot within range. You arrive at exactly the spot desired. It can be a place you can see, one you can visualize, or one you can describe by stating distance and direction, such as \"200 feet straight downward\" or \"upward to the northwest at a 45-degree angle, 300 feet.\" You can bring along objects as long as their weight doesn't exceed what you can carry. You can also bring one willing creature of your size or smaller who is carrying gear up to its carrying capacity. The creature must be within 5 feet of you when you cast this spell. If you would arrive in a place already occupied by an object or a creature, you and any creature traveling with you each take 4d6 force damage, and the spell fails to teleport you.",
    "upgrade": "",
    "level": 4
  },
  {
    "name": "Divination",
    "school": "Divination",
    "classes": [
      "Cleric",
      "Druid",
      "Ritual Caster"
    ],
    "casting time": "1 action",
    "ritual": true,
    "range": "Self",
    "target": "",
    "components": "V, S, M (Incense and a sacrificial offering appropriate to your religion, together worth at least 25gp, which the spell consumes.)",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "no",
    "description": "Your magic and an offering put you in contact with a god or a god's servants. You ask a single question concerning a specific goal, event, or activity to occur within 7 days. The DM offers a truthful reply. The reply might be a short phrase, a cryptic rhyme, or an omen. The spell doesn't take into account any possible circumstances that might change the outcome, such as the casting of additional spells or the loss or gain of a companion. If you cast the spell two or more times before finishing your next long rest, there is a cumulative 25 percent chance for each casting after the first that you get a random reading. The DM makes this roll in secret.",
    "upgrade": "",
    "level": 4
  },
  {
    "name": "Dominate Beast",
    "school": "Enchantment",
    "classes": [
      "Cleric",
      "Druid",
      "Sorcerer",
      "Warlock"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "60 feet",
    "target": "",
    "components": "V, S",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "You attempt to beguile a beast that you can see within range. It must succeed on a wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw. While the beast is charmed, you have a telepathic link with it as long as the two of you are on the same plane of existence. You can use this telepathic link to issue commands to the creature while you are conscious (no action required), which it does its best to obey. You can specify a simple and general course of action, such as \"Attack that creature,\" \"Run over there,\" or \"Fetch that object.\" If the creature completes the order and doesn't receive further direction from you, it defends and preserves itself to the best of its ability. You can use your action to take total and precise control of the target. Until the end of your next turn, the creature takes only the actions you choose, and doesn't do anything that you don't allow it to do. During this time, you can also cause the creature to use a reaction, but this requires you to use your own reaction as well. Each time the target takes damage, it makes a new wisdom saving throw against the spell. If the saving throw succeeds, the spell ends.",
    "upgrade": "When you cast this spell with a 5th-­level spell slot, the duration is concentration, up to 10 minutes. When you use a 6th-­level spell slot, the duration is concentration, up to 1 hour. When you use a spell slot of 7th level or higher, the duration is concentration, up to 8 hours.",
    "level": 4
  },
  {
    "name": "Fabricate",
    "school": "Transmutation",
    "classes": [
      "Wizard"
    ],
    "casting time": "10 minutes",
    "ritual": false,
    "range": "120 feet",
    "target": "",
    "components": "V, S",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "no",
    "description": "You convert raw materials into products of the same material. For example, you can fabricate a wooden bridge from a clump of trees, a rope from a patch of hemp, and clothes from flax or wool. Choose raw materials that you can see within range. You can fabricate a Large or smaller object (contained within a 10-foot cube, or eight connected 5-foot cubes), given a sufficient quantity of raw material. If you are working with metal, stone, or another mineral substance, however, the fabricated object can be no larger than Medium (contained within a single 5-foot cube). The quality of objects made by the spell is commensurate with the quality of the raw materials. Creatures or magic items can't be created or transmuted by this spell. You also can't use it to create items that ordinarily require a high degree of craftsmanship, such as jewelry, weapons, glass, or armor, unless you have proficiency with the type of artisan's tools used to craft such objects.",
    "upgrade": "",
    "level": 4
  },
  {
    "name": "Faithful Hound",
    "school": "Conjuration",
    "classes": [
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "30 feet",
    "target": "",
    "components": "V, S, M (A tiny silver whistle, a piece of bone, and a thread)",
    "duration": "8 hours",
    "saving throw": "",
    "concentration": "no",
    "description": "You conjure a phantom watchdog in an unoccupied space that you can see within range, where it remains for the duration, until you dismiss it as an action, or until you move more than 100 feet away from it. The hound is invisible to all creatures except you and can't be harmed. When a Small or larger creature comes within 30 feet of it without first speaking the password that you specify when you cast this spell, the hound starts barking loudly. The hound sees invisible creatures and can see into the Ethereal Plane. It ignores illusions. At the start of each of your turns, the hound attempts to bite one creature within 5 feet of it that is hostile to you. The hound's attack bonus is equal to your spellcasting ability modifier + your proficiency bonus. On a hit, it deals 4d8 piercing damage.",
    "upgrade": "",
    "level": 4
  },
  {
    "name": "Fire Shield",
    "school": "Evocation",
    "classes": [
      "Warlock",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "Self",
    "target": "",
    "components": "V, S, M (A little phosphorus or a firefly.)",
    "duration": "10 minutes",
    "saving throw": "",
    "concentration": "no",
    "description": "Thin and vaporous flame surround your body for the duration of the spell, radiating a bright light bright light in a 10-foot radius and dim light for an additional 10 feet. You can end the spell using an action to make it disappear. The flames are around you a heat shield or cold, your choice. The heat shield gives you cold damage resistance and the cold resistance to fire damage. In addition, whenever a creature within 5 feet of you hits you with a melee attack, flames spring from the shield. The attacker then suffers 2d8 points of fire damage or cold, depending on the model.",
    "upgrade": "",
    "level": 4
  },
  {
    "name": "Freedom of Movement",
    "school": "Abjuration",
    "classes": [
      "Bard",
      "Cleric",
      "Druid",
      "Paladin",
      "Ranger"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "Touch",
    "target": "",
    "components": "V, S, M (A leather strap, bound around the arm or a similar appendage.)",
    "duration": "1 hour",
    "saving throw": "",
    "concentration": "no",
    "description": "You touch a willing creature. For the duration, the target's movement is unaffected by difficult terrain, and spells and other magical effects can neither reduce the target's speed nor cause the target to be paralyzed or restrained. The target can also spend 5 feet of movement to automatically escape from nonmagical restraints, such as manacles or a creature that has it grappled. Finally, being underwater imposes no penalties on the target's movement or attacks.",
    "upgrade": "",
    "level": 4
  },
  {
    "name": "Giant Insect",
    "school": "Transmutation",
    "classes": [
      "Druid"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "30 feet",
    "target": "",
    "components": "V, S",
    "duration": "Up to 10 minutes",
    "saving throw": "",
    "concentration": "yes",
    "description": "You transform up to ten centipedes, three spiders, five wasps, or one scorpion within range into giant versions of their natural forms for the duration. A centipede becomes a giant centipede, a spider becomes a giant spider, a wasp becomes a giant wasp, and a scorpion becomes a giant scorpion. Each creature obeys your verbal commands, and in combat, they act on your turn each round. The DM has the statistics for these creatures and resolves their actions and movement. A creature remains in its giant size for the duration, until it drops to 0 hit points, or until you use an action to dismiss the effect on it. The DM might allow you to choose different targets. For example, if you transform a bee, its giant version might have the same statistics as a giant wasp.",
    "upgrade": "",
    "level": 4
  },
  {
    "name": "Greater Invisibility",
    "school": "Illusion",
    "classes": [
      "Bard",
      "Druid",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "Touch",
    "target": "",
    "components": "V, S",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "You or a creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target's person.",
    "upgrade": "",
    "level": 4
  },
  {
    "name": "Guardian of Faith",
    "school": "Conjuration",
    "classes": [
      "Cleric"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "30 feet",
    "target": "",
    "components": "V",
    "duration": "8 hours",
    "saving throw": "",
    "concentration": "no",
    "description": "A Large spectral guardian appears and hovers for the duration in an unoccupied space of your choice that you can see within range. The guardian occupies that space and is indistinct except for a gleaming sword and shield emblazoned with the symbol of your deity. Any creature hostile to you that moves to a space within 10 feet of the guardian for the first time on a turn must succeed on a Dexterity saving throw. The creature takes 20 radiant damage on a failed save, or half as much damage on a successful one. The guardian vanishes when it has dealt a total of 60 damage.",
    "upgrade": "",
    "level": 4
  },
  {
    "name": "Hallucinatory Terrain",
    "school": "Illusion",
    "classes": [
      "Bard",
      "Druid",
      "Warlock",
      "Wizard"
    ],
    "casting time": "10 minutes",
    "ritual": false,
    "range": "300 feet",
    "target": "",
    "components": "V, S, M (A stone, a twig, and a bit of green plant.You make natural terrain in a 150-foot cube in range look, sound, and smell like some other sort of natural terrain. Thus, open fields or a road can be made to resemble a swamp, hill, crevasse, or some other difficult or impassable terrain. A pond can be made to seem like a grassy meadow, a precipice like a gentle slope, or a rock-strewn gully like a wide and smooth road. Manufactured structures, equipment, and creatures within the area aren't changed in appearance.)",
    "duration": "24 hours",
    "saving throw": "",
    "concentration": "no",
    "description": "The tactile characteristics of the terrain are unchanged, so creatures entering the area are likely to see through the illusion. If the difference isn't obvious by touch, a creature carefully examining the illusion can attempt an Intelligence (Investigation) check against your spell save DC to disbelieve it. A creature who discerns the illusion for what it is, sees it as a vague image superimposed on the terrain.",
    "upgrade": "",
    "level": 4
  },
  {
    "name": "Ice Storm",
    "school": "Evocation",
    "classes": [
      "Cleric",
      "Druid",
      "Paladin",
      "Sorcerer",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "300 feet",
    "target": "",
    "components": "V, S, M (A pinch of dust and a few drops of water.)",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "no",
    "description": "A hail of rock-hard ice pounds to the ground in a 20-foot-radius, 40-foot-high cylinder centered on a point within range. Each creature in the cylinder must make a dexterity saving throw. A creature takes 2d8 bludgeoning damage and 4d6 cold damage on a failed save, or half as much damage on a successful one. Hailstones turn the storm's area of effect into difficult terrain until the end of your next turn.",
    "upgrade": "When you cast this spell using a spell slot of 5th level or higher, the bludgeoning damage increases by 1d8 for each slot level above 4th.",
    "level": 4
  },
  {
    "name": "Locate Creature",
    "school": "Divination",
    "classes": [
      "Bard",
      "Cleric",
      "Druid",
      "Paladin",
      "Ranger",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "Self",
    "target": "",
    "components": "V, S, M (A bit of fur from a bloodhound.)",
    "duration": "Up to 1 hour",
    "saving throw": "",
    "concentration": "yes",
    "description": "Describe or name a creature that is familiar to you. You sense the direction to the creature's location, as long as that creature is within 1,000 feet of you. If the creature is moving, you know the direction of its movement. The spell can locate a specific creature known to you, or the nearest creature of a specific kind (such as a human or a unicorn), so long as you have seen such a creature up close—within 30 feet—at least once. If the creature you described or named is in a different form, such as being under the effects of a polymorph spell, this spell doesn't locate the creature. This spell can't locate a creature if running water at least 10 feet wide blocks a direct path between you and the creature.",
    "upgrade": "",
    "level": 4
  },
  {
    "name": "Phantasmal Killer",
    "school": "Illusion",
    "classes": [
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "120 feet",
    "target": "",
    "components": "V, S",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "You tap into the nightmares of a creature you can see within range and create an illusory manifestation of its deepest fears, visible only to that creature. The target must make a wisdom saving throw. On a failed save, the target becomes frightened for the duration. At the start of each of the target's turns before the spell ends, the target must succeed on a wisdom saving throw or take 4 d10 psychic damage. On a successful save, the spell ends.",
    "upgrade": "When you cast this spell using a spell slot of 5th level or higher, the damage increases by 1dlO for each slot level above 4th.",
    "level": 4
  },
  {
    "name": "Polymorph",
    "school": "Transmutation",
    "classes": [
      "Bard",
      "Cleric",
      "Druid",
      "Sorcerer",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "60 feet",
    "target": "",
    "components": "V, S, M (A caterpillar cocoon.)",
    "duration": "Up to 1 hour",
    "saving throw": "",
    "concentration": "yes",
    "description": "This spell transforms a creature that you can see within range into a new form. An unwilling creature must make a wisdom saving throw to avoid the effect. A shapechanger automatically succeeds on this saving throw. The transformation lasts for the duration, or until the target drops to 0 hit points or dies. The new form can be any beast whose challenge rating is equal to or less than the target's (or the target's level, if it doesn't have a challenge rating). The target's game statistics, including mental ability scores, are replaced by the statistics of the chosen beast. It retains its alignment and personality. The target assumes the hit points of its new form. When it reverts to its normal form, the creature returns to the number of hit points it had before it transformed. If it reverts as a result of dropping to 0 hit points, any excess damage carries over to its normal form. As long as the excess damage doesn't reduce the creature's normal form to 0 hit points, it isn't knocked unconscious. The creature is limited in the actions it can perform by the nature of its new form, and it can't speak, cast spells, or take any other action that requires hands or speech. The target's gear melds into the new form. The creature can't activate, use, wield, or otherwise benefit from any of its equipment.",
    "upgrade": "",
    "level": 4
  },
  {
    "name": "Private Sanctum",
    "school": "Abjuration",
    "classes": [
      "Wizard"
    ],
    "casting time": "10 minutes",
    "ritual": false,
    "range": "120 feet",
    "target": "",
    "components": "V, S, M (A thin sheet of lead, a piece of opaque glass, a wad of cotton or cloth, and powdered chrysolite.)",
    "duration": "24 hours",
    "saving throw": "",
    "concentration": "no",
    "description": "You make an area within range magically secure. The area is a cube that can be as small as 5 feet to as large as 100 feet on each side. The spell lasts for the duration or until you use an action to dismiss it. When you cast the spell, you decide what sort of security the spell provides, choosing any or all of the following properties: - Sound can't pass through the barrier at the edge of the warded area. - The barrier of the warded area appears dark and foggy, preventing vision (including darkvision) through it. - Sensors created by divination spells can't appear inside the protected area or pass through the barrier at its perimeter. - Creatures in the area can't be targeted by divination spells. - Nothing can teleport into or out of the warded area. - Planar travel is blocked within the warded area. Casting this spell on the same spot every day for a year makes this effect permanent.",
    "upgrade": "When you cast this spell using a spell slot of 5th level or higher, you can increase the size of the cube by 100 feet for each slot level beyond 4th. Thus you could protect a cube that can be up to 200 feet on one side by using a spell slot of 5th level.",
    "level": 4
  },
  {
    "name": "Resilient Sphere",
    "school": "Evocation",
    "classes": [
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "30 feet",
    "target": "",
    "components": "V, S, M (A hemispherical piece of clear crystal and a matching hemispherical piece of gum arabic.)",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "A sphere of shimmering force encloses a creature or object of Large size or smaller within range. An unwilling creature must make a dexterity saving throw. On a failed save, the creature is enclosed for the duration. Nothing—not physical objects, energy, or other spell effects—can pass through the barrier, in or out, though a creature in the sphere can breathe there. The sphere is immune to all damage, and a creature or object inside can't be damaged by attacks or effects originating from outside, nor can a creature inside the sphere damage anything outside it. The sphere is weightless and just large enough to contain the creature or object inside. An enclosed creature can use its action to push against the sphere's walls and thus roll the sphere at up to half the creature's speed. Similarly, the globe can be picked up and moved by other creatures. A disintegrate spell targeting the globe destroys it without harming anything inside it.",
    "upgrade": "",
    "level": 4
  },
  {
    "name": "Secret Chest",
    "school": "Conjuration",
    "classes": [
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "Touch",
    "target": "",
    "components": "V, S, M (An exquisite chest, 3 feet by 2 feet by 2 feet, constructed from rare materials worth at least 5,000 gp, and a Tiny replica made from the same materials worth at least 50 gp.)",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "no",
    "description": "You hide a chest, and all its contents, on the Ethereal Plane. You must touch the chest and the miniature replica that serves as a material component for the spell. The chest can contain up to 12 cubic feet of nonliving material (3 feet by 2 feet by 2 feet). While the chest remains on the Ethereal Plane, you can use an action and touch the replica to recall the chest. It appears in an unoccupied space on the ground within 5 feet of you. You can send the chest back to the Ethereal Plane by using an action and touching both the chest and the replica. After 60 days, there is a cumulative 5 percent chance per day that the spell's effect ends. This effect ends if you cast this spell again, if the smaller replica chest is destroyed, or if you choose to end the spell as an action. If the spell ends and the larger chest is on the Ethereal Plane, it is irretrievably lost.",
    "upgrade": "",
    "level": 4
  },
  {
    "name": "Stone Shape",
    "school": "Transmutation",
    "classes": [
      "Cleric",
      "Druid",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "Touch",
    "target": "",
    "components": "V, S, M (Soft clay, to be crudely worked into the desired shape for the stone object.)",
    "duration": "Instantaneous",
    "saving throw": "",
    "concentration": "no",
    "description": "You touch a stone object of Medium size or smaller or a section of stone no more than 5 feet in any dimension and form it into any shape that suits your purpose. So, for example, you could shape a large rock into a weapon, idol, or coffer, or make a small passage through a wall, as long as the wall is less than 5 feet thick. You could also shape a stone door or its frame to seal the door shut. The object you create can have up to two hinges and a latch, but finer mechanical detail isn't possible.",
    "upgrade": "",
    "level": 4
  },
  {
    "name": "Stoneskin",
    "school": "Abjuration",
    "classes": [
      "Cleric",
      "Druid",
      "Paladin",
      "Ranger",
      "Sorcerer",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "Touch",
    "target": "",
    "components": "V, S, M (Diamond dust worth 100 gp, which the spell consumes.)",
    "duration": "Up to 1 hour",
    "saving throw": "",
    "concentration": "yes",
    "description": "This spell turns the flesh of a willing creature you touch as hard as stone. Until the spell ends, the target has resistance to nonmagical bludgeoning, piercing, and slashing damage.",
    "upgrade": "",
    "level": 4
  },
  {
    "name": "Wall of Fire",
    "school": "Evocation",
    "classes": [
      "Cleric",
      "Druid",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "casting time": "1 action",
    "ritual": false,
    "range": "120 feet",
    "target": "",
    "components": "V, S, M (A small piece of phosphorus.)",
    "duration": "Up to 1 minute",
    "saving throw": "",
    "concentration": "yes",
    "description": "You create a wall of fire on a solid surface within range. You can make the wall up to 60 feet long, 20 feet high, and 1 foot thick, or a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall is opaque and lasts for the duration. When the wall appears, each creature within its area must make a Dexterity saving throw. On a failed save, a creature takes 5d8 fire damage, or half as much damage on a successful save. One side of the wall, selected by you when you cast this spell, deals 5d8 fire damage to each creature that ends its turn within 10 feet o f that side or inside the wall. A creature takes the same damage when it enters the wall for the first time on a turn or ends its turn there. The other side o f the wall deals no damage. The other side of the wall deals no damage.",
    "upgrade": "When you cast this spell using a level spell slot 5 or more, the damage of the spell increases by 1d8 for each level of higher spell slot to 4.",
    "level": 4
  }
]
