[
  {
    "name": "Fighter",
    "hit_dice": 10,
    "weapon_proficiencies_to_add": ["Simple Weapons", "Martial Weapons"],
    "skill_proficiency_choices": {
      "number": 2,
      "skill_list": ["Acrobatics", "Animal Handling", "Athletics", "History", "Insight", "Intimidation",
        "Perception", "Survival"]
    },
    "class_features": [
      {
        "name": "Second Wind",
        "description": "You have a limited well of stamina you can draw upon to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level.Once you use this feature, you must finish a short or long rest before you can use it again."
      }
    ],
    "class_feature_choices": [
      {
        "name": "Fighting Style",
        "description": "Choose one of the following options. You can't choose the same style twice, even if you later get to choose again.",
        "choice_table": [
          {
            "name": "Archery",
            "description": "You gain a +2 bonus on attack rolls you make with ranged weapons"
          },
          {
            "name": "Defender",
            "description": "When wearing armor, you gain a +1 bonus to AC."
          },
          {
            "name": "Dueling",
            "description": "When wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon."
          },
          {
            "name": "Great Weapon Fighting",
            "description": "When you roll a 1 or 2 on a damage die for an attack you make with a weapon held in two hands, you can re-roll the die and must use the new roll, even if it a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit"
          },
          {
            "name": "Mariner",
            "description": "As long as you are not wearing heavy armor or wearing a shield, you have a swimming speed and a climbing speed equal to your normal speed, and you gain a +1 bonus to AC."
          },
          {
            "name": "Protection",
            "description": "When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield."
          },
          {
            "name": "Two Weapon Fighting",
            "description": "When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second Attack."
          }
        ]
      }
    ],
    "armor_proficiencies_to_add": ["Light Armor", "Medium Armor", "Heavy Armor", "Shields"],
    "tool_proficiencies_to_add": [],
    "saving_throws_proficiencies": ["Strength", "Constitution"],
    "added_equipment": [],
    "equipment_choice": [["Chain mail", "Leather Armor, Longbow, 20 arrows"], ["Martial Weapon, Shield", "Two Martial Weapons"],["Light Crossbow, 20 bolts", "Two Handaxes"], ["Dungeoneer's Pack", "Explorer's Pack"]]
  },
  {
    "name": "Rogue",
    "hit_dice": 8,
    "weapon_proficiencies_to_add": ["Simple Weapons", "Hand Crossbows", "Longswords", "Rapiers", "Shortswords"],
    "skill_proficiency_choices": {
      "number": 4,
      "skill_list": ["Acrobatics", "Athletics", "Deception", "Insight", "Intimidation","Investigation",
        "Perception", "Performance", "Persuasion", "Sleight of Hand", "Stealth"]
    },
    "class_features": [
      {
        "name": "Expertise",
        "description": "At 1st level, choose two of your skill proficiencies, or one of your skill proficiencies and your proficiency with thieves' tools. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies.At 6th level, you can choose two more of your proficiencies (in skills or with thieves' tools) to gain this benefit."
      },
      {
        "name": "Sneak attack",
        "description": "Beginning at 1st level, you know how to strike subtly and exploit a foe's distraction. Once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack if you have advantage on the attack roll. The attack must use a finesse or a ranged weapon.You don't need advantage on the attack roll if another enemy of the target is within 5 feet of it, that enemy isn't incapacitated, and you don't have disadvantage on the attack roll.The amount of the extra damage increases as you gain levels in this class, as shown in the Sneak Attack column of the Rogue table"
      },
      {
        "name": "Thieves' Cant",
        "description": "During your rogue training you learned thieves' cant, a secret mix of dialect, jargon, and code that allows you to hide messages in seemingly normal conversation. Only another creature that knows thieves' cant understands such messages. It takes four times longer to convey such a message than it does to speak the same idea plainly.In addition, you understand a set of secret signs and symbols used to convey short, simple messages, such as whether an area is dangerous or the territory of a thieves' guild, whether loot is nearby, or whether the people in an area are easy marks or will provide a safe house for thieves on the run."
      }
    ],
    "class_feature_choices": [],
    "armor_proficiencies_to_add": ["Light armor"],
    "tool_proficiencies_to_add": ["Thieves Tools"],
    "saving_throws_proficiencies": ["Dexterity", "Intelligence"],
    "added_equipment": ["Thieves' Tools", "Leather Armor", "Two Daggers"],
    "equipment_choice": [["Rapier", "Shortsword"], ["Shortbow, Quiver of 20 arrows", "Shortsword"],["Burglar's Pack", "Dungeoneer's Pack", "Explorer's Pack"]]
  },
  {
    "name": "Barbarian",
    "hit_dice": 12,
    "weapon_proficiencies_to_add": ["Simple Weapons", "Martial Weapons"],
    "skill_proficiency_choices": {
      "number": 2,
      "skill_list": ["Animal Handling", "Athletics", "Intimidation", "Nature", "Perception", "Survival"]
    },
    "class_features": [
      {
        "name": "Rage",
        "description": "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action.While raging, you gain the following benefits if you aren't wearing heavy armor:    You have advantage on Strength checks and Strength saving throws.    When you make a melee weapon attack using Strength, you gain a bonus to the damage roll that increases as you gain levels as a barbarian, as shown in the Rage Damage column of the Barbarian table.    You have resistance to bludgeoning, piercing, and slashing damage.If you are able to cast spells, you can't cast them or concentrate on them while raging.Your rage lasts for 1 minute. It ends early if you are knocked srd:unconscious or if your turn ends and you haven't attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action.Once you have raged the number of times shown for your barbarian level in the Rages column of the Barbarian table, you must finish a long rest before you can rage again."
      },
      {
        "name": "Unarmored Defense",
        "description": "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit."
      }
    ],
    "class_feature_choices": [],
    "armor_proficiencies_to_add": ["Light Armor", "Medium Armor", "Shields"],
    "tool_proficiencies_to_add": [],
    "saving_throws_proficiencies": ["Strength", "Constitution"],
    "added_equipment": ["Explorer's Pack", "Four Javelins"],
    "equipment_choice": [["Greataxe", "Martial Melee Weapon"], ["Two Handaxes", "Simple Weapon"]]
  }
]