[
  {
    "name": "Fighter",
    "hit_dice": 10,
    "weapon_proficiencies_to_add": ["Simple Weapons", "Martial Weapons"],
    "skill_proficiency_choices": {
      "number": 2,
      "skill_list": ["Acrobatics", "Animal Handling", "Athletics", "History", "Insight", "Intimidation",
        "Perception", "Survival"]
    },
    "class_features": [
      {
        "name": "Second Wind",
        "description": "You have a limited well of stamina you can draw upon to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level.Once you use this feature, you must finish a short or long rest before you can use it again."
      }
    ],
    "class_feature_choices": [
      {
        "name": "Fighting Style",
        "description": "Choose one of the following options. You can't choose the same style twice, even if you later get to choose again.",
        "choice_table": [
          {
            "name": "Archery",
            "description": "You gain a +2 bonus on attack rolls you make with ranged weapons"
          },
          {
            "name": "Defender",
            "description": "When wearing armor, you gain a +1 bonus to AC."
          },
          {
            "name": "Dueling",
            "description": "When wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon."
          },
          {
            "name": "Great Weapon Fighting",
            "description": "When you roll a 1 or 2 on a damage die for an attack you make with a weapon held in two hands, you can re-roll the die and must use the new roll, even if it a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit"
          },
          {
            "name": "Mariner",
            "description": "As long as you are not wearing heavy armor or wearing a shield, you have a swimming speed and a climbing speed equal to your normal speed, and you gain a +1 bonus to AC."
          },
          {
            "name": "Protection",
            "description": "When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield."
          },
          {
            "name": "Two Weapon Fighting",
            "description": "When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second Attack."
          }
        ]
      }
    ],
    "armor_proficiencies_to_add": ["Light Armor", "Medium Armor", "Heavy Armor", "Shields"],
    "tool_proficiencies_to_add": [],
    "saving_throws_proficiencies": ["Strength", "Constitution"],
    "added_equipment": [],
    "equipment_choice": "Chain Mail/Leather Armor, Longbow, 20 arrows#Martial Weapon, Shield/Two Martial Weapons#Light Crossbow, 20 bolts/Two Handaxes#Dungeoneer Pack/Explorer Pack",
    "cantrips_to_add": {
      "number": 0,
      "class_list": ""
    },
    "spells_to_add": 0,
    "level_one_spell_slots": 0
  },
  {
    "name": "Rogue",
    "hit_dice": 8,
    "weapon_proficiencies_to_add": ["Simple Weapons", "Hand Crossbows", "Longswords", "Rapiers", "Shortswords"],
    "skill_proficiency_choices": {
      "number": 4,
      "skill_list": ["Acrobatics", "Athletics", "Deception", "Insight", "Intimidation","Investigation",
        "Perception", "Performance", "Persuasion", "Sleight of Hand", "Stealth"]
    },
    "class_features": [
      {
        "name": "Expertise",
        "description": "At 1st level, choose two of your skill proficiencies, or one of your skill proficiencies and your proficiency with thieves' tools. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies.At 6th level, you can choose two more of your proficiencies (in skills or with thieves' tools) to gain this benefit."
      },
      {
        "name": "Sneak attack",
        "description": "Beginning at 1st level, you know how to strike subtly and exploit a foe's distraction. Once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack if you have advantage on the attack roll. The attack must use a finesse or a ranged weapon.You don't need advantage on the attack roll if another enemy of the target is within 5 feet of it, that enemy isn't incapacitated, and you don't have disadvantage on the attack roll.The amount of the extra damage increases as you gain levels in this class, as shown in the Sneak Attack column of the Rogue table"
      },
      {
        "name": "Thieves' Cant",
        "description": "During your rogue training you learned thieves' cant, a secret mix of dialect, jargon, and code that allows you to hide messages in seemingly normal conversation. Only another creature that knows thieves' cant understands such messages. It takes four times longer to convey such a message than it does to speak the same idea plainly.In addition, you understand a set of secret signs and symbols used to convey short, simple messages, such as whether an area is dangerous or the territory of a thieves' guild, whether loot is nearby, or whether the people in an area are easy marks or will provide a safe house for thieves on the run."
      }
    ],
    "class_feature_choices": [],
    "armor_proficiencies_to_add": ["Light armor"],
    "tool_proficiencies_to_add": ["Thieves Tools"],
    "saving_throws_proficiencies": ["Dexterity", "Intelligence"],
    "added_equipment": ["Thieves' Tools", "Leather Armor", "Two Daggers"],
    "equipment_choice": "Rapier/Short Sword#Shortbow, Quiver, 20 arrows/Short Sword#Burglar Pack/Dungeoneer Pack/Explorer Pack",
    "cantrips_to_add": {
      "number": 0,
      "class_list": ""
    },
    "spells_to_add": 0,
    "level_one_spell_slots": 0
  },
  {
    "name": "Barbarian",
    "hit_dice": 12,
    "weapon_proficiencies_to_add": ["Simple Weapons", "Martial Weapons"],
    "skill_proficiency_choices": {
      "number": 2,
      "skill_list": ["Animal Handling", "Athletics", "Intimidation", "Nature", "Perception", "Survival"]
    },
    "class_features": [
      {
        "name": "Rage",
        "description": "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action.While raging, you gain the following benefits if you aren't wearing heavy armor:    You have advantage on Strength checks and Strength saving throws.    When you make a melee weapon attack using Strength, you gain a bonus to the damage roll that increases as you gain levels as a barbarian, as shown in the Rage Damage column of the Barbarian table.    You have resistance to bludgeoning, piercing, and slashing damage.If you are able to cast spells, you can't cast them or concentrate on them while raging.Your rage lasts for 1 minute. It ends early if you are knocked srd:unconscious or if your turn ends and you haven't attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action.Once you have raged the number of times shown for your barbarian level in the Rages column of the Barbarian table, you must finish a long rest before you can rage again."
      },
      {
        "name": "Unarmored Defense",
        "description": "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit."
      }
    ],
    "class_feature_choices": [],
    "armor_proficiencies_to_add": ["Light Armor", "Medium Armor", "Shields"],
    "tool_proficiencies_to_add": [],
    "saving_throws_proficiencies": ["Strength", "Constitution"],
    "added_equipment": ["Explorer's Pack", "Four Javelins"],
    "equipment_choice": "Greataxe/Martial Melee Weapon#Two Handaxes/Simple Weapon",
    "cantrips_to_add": {
      "number": 0,
      "class_list": ""
    },
    "spells_to_add": 0,
    "level_one_spell_slots": 0
  },
  {
    "name": "Paladin",
    "hit_dice": 10,
    "weapon_proficiencies_to_add": ["Simple Weapons", "Martial Weapons"],
    "skill_proficiency_choices": {
      "number": 2,
      "skill_list": [
        "Athletics",
        "Insight",
        "Intimidation",
        "Medicine",
        "Persuasion",
        "Religion"
      ]
    },
    "class_features": [
      {
        "name": "Divine Sense",
        "description": "The presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity (the vampire Count Strahd von Zarovich, for instance). Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the srd:hallow spell.You can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses."
      },
      {
        "name": "Lay on Hands",
        "description": "Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level × 5.As an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool.Alternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one.This feature has no effect on undead and constructs."
      }
    ],
    "class_feature_choices": [
      {
        "name": "",
        "description": "",
        "choice_table": [
          {
            "name": "",
            "description":  ""
          }
        ]
      }
    ],
    "armor_proficiencies_to_add": ["Light Armor", "Medium Armor", "Heavy Armor", "Shields"],
    "tool_proficiencies_to_add": [],
    "saving_throws_proficiencies": ["Wisdom", "Charisma"],
    "added_equipment": ["Chain Mail", "Holy Symbol"],
    "equipment_choice": "Martial Weapon, Shield/Two Martial Weapons#Five Javelins/Simple Melee Weapon#Priest Pack/Explorer Pack",
    "cantrips_to_add": {
      "number": 0,
      "class_list": ""
    },
    "spells_to_add": 0,
    "level_one_spell_slots": 0
  },
  {
    "name": "Monk",
    "hit_dice": 8,
    "weapon_proficiencies_to_add": ["Simple Weapons", "Shortswords"],
    "skill_proficiency_choices": {
      "number": 2,
      "skill_list": ["Acrobatics", "Athletics", "History", "Insight", "Religion", "Stealth"]
    },
    "class_features": [
      {
        "name": "Unarmored Defense",
        "description": "Beginning at 1st level, while you are wearing no armor and not wielding a shield, your AC equals 10 + your Dexterity modifier + your Wisdom modifier."
      },
      {
        "name": "Martial Arts",
        "description": "At 1st level, your practice of martial arts gives you mastery of combat styles that use unarmed strikes and monk weapons, which are shortswords and any simple melee weapons that don't have the two-handed or heavy property.You gain the following benefits while you are unarmed or wielding only monk weapons and you aren't wearing armor or wielding a shield:    You can use Dexterity instead of Strength for the attack and damage rolls of your unarmed strikes and monk weapons.    You can roll a d4 in place of the normal damage of your unarmed strike or monk weapon. This die changes as you gain monk levels, ashown in the Martial Arts column of the Monk table.    When you use the Attack action with an unarmed strike or a monk weapon on your turn, you can make one unarmed strike as a bonus action. For example, if you take the Attack action and attack with a quarterstaff, you can also make an unarmed strike as a bonus action, assuming you haven't already taken a bonus action this turn.Certain monasteries use specialized forms of the monk weapons. For example, you might use a club that is two lengths of wood connected by a short chain (called a nunchaku) or a sickle with a shorter, straighter blade (called a kama). Whatever name you use for a monk weapon, you can use the game statistics provided for the weapon."

      }
    ],
    "class_feature_choices": [
      {
        "name": "",
        "description": "",
        "choice_table": [
          {
            "description": "",
            "name": ""
          }
        ]
      }
    ],
    "tool_proficiencies_to_add": [],
    "armor_proficiencies_to_add": [],
    "saving_throws_proficiencies": ["Strength", "Dexterity"],
    "added_equipment": ["10 darts"],
    "equipment_choice": "Short Sword/Simple Weapon#Dungeoneer Pack/Explorer Pack",
    "cantrips_to_add": {
      "number": 0,
      "class_list": ""
    },
    "spells_to_add": 0,
    "level_one_spell_slots": 0
  },
  {
    "name": "Wizard",
    "hit_dice": 6,
    "weapon_proficiencies_to_add": ["Dagger", "Darts", "Sling", "Quarterstaff", "Light Crossbow"],
    "skill_proficiency_choices": {
      "number": 2,
      "skill_list": ["Arcana", "History", "Insight", "Investigation", "Medicine", "Religion"]
    },
    "class_features": [
      {
        "name": "Spellcasting",
        "description": "As a student of arcane magic, you have a spellbook containing spells that show the first glimmerings of your true power.Cantrips At 1st level, you know three cantrips of your choice from the srd:wizard-spells list. You learn additional wizard cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Wizard table.SpellbookAt 1st level, you have a spellbook containing six 1st-level wizard spells of your choice. Your spellbook is the repository of the wizard spells you know, except your cantrips, which are fixed in your mind.Preparing and Casting SpellsThe Wizard table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.You prepare the list of wizard spells that are available for you to cast. To do so, choose a number of wizard spells from your spellbook equal to your Intelligence modifier + your wizard level (minimum of one spell). The spells must be of a level for which you have spell slots.For example, if you're a 3rd-level wizard, you have four 1st-level and two 2nd-level spell slots. With an Intelligence of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination, chosen from your spellbook. If you prepare the 1st-level spell srd:magic-missile, you can cast it using a 1st-level or a 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.You can change your list of prepared spells when you finish a long rest. Preparing a new list of wizard spells requires time spent studying your spellbook and memorizing the incantations and gestures you must make to cast the spell: at least 1 minute per spell level for each spell on your list.Spellcasting AbilityIntelligence is your spellcasting ability for your wizard spells, since you learn your spells through dedicated study and memorization. You use your Intelligence whenever a spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for a wizard spell you cast and when making an attack roll with one.    Spell save DC = 8 + your proficiency bonus + your Intelligence modifier    Spell attack modifier = your proficiency bonus + your Intelligence modifierRitual CastingYou can cast a wizard spell as a ritual if that spell has the ritual tag and you have the spell in your spellbook. You don't need to have the spell prepared.Spellcasting FocusYou can use an arcane focus as a spellcasting focus for your wizard spells.Learning Spells of 1st Level and Higher Each time you gain a wizard level, you can add two wizard spells of your choice to your spellbook for free. Each of these spells must be of a level for which you have spell slots, as shown on the Wizard table. On your adventures, you might find other spells that you can add to your spellbook (see the \"Your Spellbook\" sidebar)."
      },
      {
        "name": "Arcane Recovery",
        "description": "You have learned to regain some of your magical energy by studying your spellbook. Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher.For example, if you're a 4th-level wizard, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level spell slot or two 1st-level spell slots."
      }
    ],
    "class_feature_choices": [
      {
        "name":"",
        "description": "",
        "choice_table": [
          {
            "name": "",
            "description":  ""
          }
        ]
      }
    ],
    "armor_proficiencies_to_add": [],
    "tool_proficiencies_to_add": [],
    "saving_throws_proficiencies": ["Intelligence", "Wisdom"],
    "added_equipment": ["Spellbook"],
    "equipment_choice": "Quarterstaff/Dagger#Component Pouch/Arcane Focus#Scholar Pack/Explorer Pack",
    "cantrips_to_add": {
      "number": 3,
      "class_list": "Wizard"
    },
    "spells_to_add": 6,
    "level_one_spell_slots": 2
  },
  {
    "name": "Sorcerer",
    "hit_dice": 6,
    "weapon_proficiencies_to_add": ["Dagger", "Darts", "Sling", "Quarterstaff", "Light Crossbow"],
    "skill_proficiency_choices": {
      "number": 2,
      "skill_list": ["Arcana", "Deception", "Insight", "Intimidation", "Persuasion", "Religion"]
    },
    "class_features": [
      {
        "name": "Spellcasting",
        "description": "An event in your past, or in the life of a parent or ancestor, left an indelible mark on you, infusing you with arcane magic. This font of magic, whatever its origin, fuels your spells.CantripsAt 1st level, you know four cantrips of your choice from the srd:sorcerer-spells list. You learn additional sorcerer cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Sorcerer table.Spell SlotsThe Sorcerer table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these sorcerer spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.For example, if you know the 1st-level spell burning hands and have a 1st-level and a 2nd-level spell slot available, you can cast burning hands using either slot.Spells Known of 1st Level and HigherYou know two 1st-level spells of your choice from the srd:sorcerer-spells list.The Spells Known column of the Sorcerer table shows when you learn more sorcerer spells of your choice. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 3rd level in this class, you can learn one new spell of 1st or 2nd level.Additionally, when you gain a level in this class, you can choose one of the sorcerer spells you know and replace it with another spell from the sorcerer spell list, which also must be of a level for which you have spell slots.Spellcasting AbilityCharisma is your spellcasting ability for your sorcerer spells, since the power of your magic relies on your ability to project your will into the world. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a sorcerer spell you cast and when making an attack roll with one.    Spell save DC = 8 + your proficiency bonus + your Charisma modifier    Spell attack modifier = your proficiency bonus + your Charisma modifierSpellcasting FocusYou can use an arcane focus as a spellcasting focus for your sorcerer spells."
      }
    ],
    "class_feature_choices": [
      {
        "name":"Sorcerous Origin",
        "description": "Choose a sorcerous origin, which describes the source of your innate magical power, such as Draconic Bloodline.Your choice grants you features when you choose it at 1st level and again at 6th, 14th, and 18th level.",
        "choice_table": [
          {
            "name": "Draconic Bloodline",
            "description":  "Your innate magic comes from draconic magic that was mingled with your blood or that of your ancestors. Most often, sorcerers with this origin trace their descent back to a mighty sorcerer of ancient times who made a bargain with a dragon or who might even have claimed a dragon parent. Some of these bloodlines are well established in the world, but most are obscure. Any given sorcerer could be the first of a new bloodline, as a result of a pact or some other exceptional circumstance.Dragon AncestorAt 1st level, you choose one type of dragon as your ancestor. The damage type associated with each dragon is used by features you gain later.Draconic Ancestry Dragon Damage TypeBlack Acid Blue Lightning Brass Fire Bronze Lightning Copper Acid Gold Fire Green Poison Red Fire Silver Cold White ColdYou can speak, read, and write Draconic. Additionally, whenever you make a Charisma check when interacting with dragons, your proficiency bonus is doubled if it applies to the check.Draconic ResilienceAs magic flows through your body, it causes physical traits of your dragon ancestors to emerge. At 1st level, your hit point maximum increases by 1 and increases by 1 again whenever you gain a level in this class.Additionally, parts of your skin are covered by a thin sheen of dragon-like scales. When you aren't wearing armor, your AC equals 13 + your Dexterity modifier."
          }
        ]
      }
    ],
    "armor_proficiencies_to_add": [],
    "tool_proficiencies_to_add": [],
    "saving_throws_proficiencies": ["Constitution", "Charisma"],
    "added_equipment": ["Two daggers"],
    "equipment_choice": "Light Crossbow, 20 bolts/Simple Weapon#Component Pouch/Arcane Focus#Dungeoneer Pack/Explorer Pack",
    "cantrips_to_add": {
      "number": 4,
      "class_list": "Sorcerer"
    },
    "spells_to_add": 2,
    "level_one_spell_slots": 2
  }
]

